import 'package:flutter/material.dart';
import 'package:flutter/foundation.dart';
import 'package:shared_preferences/shared_preferences.dart';

const _kLocaleStorageKey = '__locale_key__';

class FFLocalizations {
  FFLocalizations(this.locale);

  final Locale locale;

  static FFLocalizations of(BuildContext context) =>
      Localizations.of<FFLocalizations>(context, FFLocalizations)!;

  static List<String> languages() => ['ru', 'kk'];

  static late SharedPreferences _prefs;
  static Future initialize() async =>
      _prefs = await SharedPreferences.getInstance();
  static Future storeLocale(String locale) =>
      _prefs.setString(_kLocaleStorageKey, locale);
  static Locale? getStoredLocale() {
    final locale = _prefs.getString(_kLocaleStorageKey);
    return locale != null && locale.isNotEmpty ? createLocale(locale) : null;
  }

  String get languageCode => locale.toString();
  String? get languageShortCode =>
      _languagesWithShortCode.contains(locale.toString())
          ? '${locale.toString()}_short'
          : null;
  int get languageIndex => languages().contains(languageCode)
      ? languages().indexOf(languageCode)
      : 0;

  String getText(String key) =>
      (kTranslationsMap[key] ?? {})[locale.toString()] ?? '';

  String getVariableText({
    String? ruText = '',
    String? kkText = '',
  }) =>
      [ruText, kkText][languageIndex] ?? '';

  static const Set<String> _languagesWithShortCode = {
    'ar',
    'az',
    'ca',
    'cs',
    'da',
    'de',
    'dv',
    'en',
    'es',
    'et',
    'fi',
    'fr',
    'gr',
    'he',
    'hi',
    'hu',
    'it',
    'km',
    'ku',
    'mn',
    'ms',
    'no',
    'pt',
    'ro',
    'ru',
    'rw',
    'sv',
    'th',
    'uk',
    'vi',
  };
}

class FFLocalizationsDelegate extends LocalizationsDelegate<FFLocalizations> {
  const FFLocalizationsDelegate();

  @override
  bool isSupported(Locale locale) {
    final language = locale.toString();
    return FFLocalizations.languages().contains(
      language.endsWith('_')
          ? language.substring(0, language.length - 1)
          : language,
    );
  }

  @override
  Future<FFLocalizations> load(Locale locale) =>
      SynchronousFuture<FFLocalizations>(FFLocalizations(locale));

  @override
  bool shouldReload(FFLocalizationsDelegate old) => false;
}

Locale createLocale(String language) => language.contains('_')
    ? Locale.fromSubtags(
        languageCode: language.split('_').first,
        scriptCode: language.split('_').last,
      )
    : Locale(language);

final kTranslationsMap = <Map<String, Map<String, String>>>[
  // HomePage
  {
    '5l68l5x0': {
      'ru': 'Hi-Test',
      'kk': 'Hi-Test',
    },
    'dyr2cjwk': {
      'ru': 'Мобильное приложение  интернет олимпиад',
      'kk': 'Интернет-олимпиадаға арналған мобильді қосымша',
    },
    'scg0l0qv': {
      'ru': 'Дарите подарки своим друзьям и близким, а мы доставим ',
      'kk': 'Достарыңызға және отбасыңызға сыйлық беріңіз, біз жеткіземіз',
    },
    'o8jxhfp5': {
      'ru': 'Сэкономьте свой бюджет на доставке',
      'kk': 'Жеткізу кезінде бюджетіңізді үнемдеңіз',
    },
    '10iau77s': {
      'ru': 'Продолжить',
      'kk': 'Жалғастыру',
    },
    'hmlqioft': {
      'ru': 'Войти',
      'kk': 'Кіру үшін',
    },
    'ko80hzgs': {
      'ru': 'Продолжить',
      'kk': 'Жалғастыру',
    },
    'foj7dkhn': {
      'ru': 'Войти',
      'kk': 'Кіру үшін',
    },
    's3s6uxzg': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // registerSchool
  {
    'e1mlpzpg': {
      'ru': 'Регистрация',
      'kk': 'Тіркеу',
    },
    'uz6lj5xt': {
      'ru': 'Мобильное приложение  интернет олимпиад',
      'kk': 'Интернет-олимпиадаға арналған мобильді қосымша',
    },
    '1b657jtp': {
      'ru': 'Почта',
      'kk': 'Пошта',
    },
    '74ce1l7n': {
      'ru': 'Имя',
      'kk': 'Аты',
    },
    '0q1zk1nw': {
      'ru': 'Фамилия',
      'kk': 'Тегі',
    },
    '9qzk9mld': {
      'ru': 'Пароль',
      'kk': 'Құпия сөз',
    },
    'jiuzd8mi': {
      'ru': 'Подтвердите пароль',
      'kk': 'Құпия сөзді растаңыз',
    },
    'aau7etz2': {
      'ru': 'Зарегистрироваться',
      'kk': 'Тіркелу',
    },
    '8e7yrdnk': {
      'ru': 'Я согласен с условиями Оферты ',
      'kk': 'Мен Ұсыныс шарттарымен келісемін',
    },
    'vqq65m1o': {
      'ru': 'Уже имеется аккаунт?',
      'kk': 'Есептік жазбаңыз бар ма?',
    },
    '12sdfdx8': {
      'ru': ' Авторизоваться',
      'kk': 'Кіру үшін',
    },
    '1wc7ignh': {
      'ru': 'или войти как Гость',
      'kk': 'Есептік жазбаңыз бар ма?',
    },
    'qfpozjsl': {
      'ru': 'Регистрация',
      'kk': 'Тіркеу',
    },
    '9v2hh2mz': {
      'ru': 'Имя*',
      'kk': 'аты*',
    },
    'bdrlkl6m': {
      'ru': '',
      'kk': 'Аты',
    },
    'qf873y84': {
      'ru': 'Имя',
      'kk': 'Аты',
    },
    'ezl4eyyj': {
      'ru': 'Фамилия*',
      'kk': 'тегі*',
    },
    'rblobvim': {
      'ru': '',
      'kk': 'Тегі',
    },
    'jezoot78': {
      'ru': 'Фамилия',
      'kk': 'Тегі',
    },
    'fbwv5tcr': {
      'ru': 'Номер телефона*',
      'kk': 'Телефон нөмірі*',
    },
    'hgrwaqni': {
      'ru': '',
      'kk': 'Телефон нөмірі',
    },
    'gckrjz1b': {
      'ru': 'Номер телефона',
      'kk': 'Телефон нөмірі',
    },
    'lggyq70h': {
      'ru': 'Email*',
      'kk': 'Электрондық пошта*',
    },
    'nghfphlm': {
      'ru': '',
      'kk': 'Электрондық пошта',
    },
    'tuoqc0xd': {
      'ru': 'Email',
      'kk': 'Электрондық пошта',
    },
    'k7bknykk': {
      'ru': 'Пароль*',
      'kk': 'Құпия сөз*',
    },
    'day2wmy3': {
      'ru': '',
      'kk': 'Құпия сөз',
    },
    '53scbb35': {
      'ru': 'Пароль',
      'kk': 'Құпия сөз',
    },
    'hiq4k9fu': {
      'ru': 'Повторите пароль*',
      'kk': 'Құпия сөзді қайталаңыз*',
    },
    'byhtqzhm': {
      'ru': '',
      'kk': 'Құпия сөзді қайталаңыз',
    },
    'ta56fj6c': {
      'ru': 'Повторите пароль',
      'kk': 'Құпия сөзді қайталаңыз',
    },
    'y1fo1rkj': {
      'ru': 'Зарегистрироваться',
      'kk': 'Тіркелу',
    },
    'i9nitn0k': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'yj937qxd': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'b4tisla5': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'uh0q3gt2': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'ov5tpgpd': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'j2g4o2p7': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '2gmkuahv': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'ebs115bl': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'rxfikuqt': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'fwah94ho': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'pb57y88f': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'g17shbsb': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'u1z6luka': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // Login
  {
    'lytm6m5g': {
      'ru': 'Вход',
      'kk': 'Кіру',
    },
    '6ldj57e8': {
      'ru': 'Мобильное приложение  интернет олимпиад',
      'kk': 'Интернет-олимпиадаға арналған мобильді қосымша',
    },
    'zgf2zxvj': {
      'ru': 'Почта',
      'kk': 'Пошта',
    },
    '6hvpo7sd': {
      'ru': 'Пароль',
      'kk': 'Құпия сөз',
    },
    '20hc7g7h': {
      'ru': 'Войти',
      'kk': 'Кіру үшін',
    },
    '0daqgcvj': {
      'ru': 'Я согласен с условиями Оферты ',
      'kk': 'Мен Ұсыныс шарттарымен келісемін',
    },
    'w39ksbb4': {
      'ru': 'Нет аккаунта? ',
      'kk': 'Есептік жазбаңыз жоқ па?',
    },
    '7q751nfh': {
      'ru': 'Зарегистироваться',
      'kk': 'Тіркелу',
    },
    'dby2vdhi': {
      'ru': 'или войти как Гость',
      'kk': 'Есептік жазбаңыз жоқ па?',
    },
    'og60dpmm': {
      'ru': 'Вход',
      'kk': 'Кіру',
    },
    '47y0zp5l': {
      'ru': 'Email*',
      'kk': 'Электрондық пошта*',
    },
    'dygf8qs9': {
      'ru': '',
      'kk': 'Электрондық пошта',
    },
    'zfvppo9u': {
      'ru': 'Email',
      'kk': 'Электрондық пошта',
    },
    'csbhss20': {
      'ru': 'Пароль*',
      'kk': 'Құпия сөз*',
    },
    '9pykc7iv': {
      'ru': '',
      'kk': 'Құпия сөз',
    },
    'jluoyzfg': {
      'ru': 'Пароль',
      'kk': 'Құпия сөз',
    },
    'uf1y8ynz': {
      'ru': 'Вход',
      'kk': 'Кіру',
    },
    'jbcirs1w': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // Main
  {
    '57j8do8t': {
      'ru': '',
      'kk': 'Іздеу',
    },
    'gbeg2p9v': {
      'ru': 'Поиск',
      'kk': '',
    },
    'gu6n8wie': {
      'ru': 'Новости ',
      'kk': 'Жаңалықтар',
    },
    'ovcn42j1': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    'rzb5bc5r': {
      'ru': 'Курсы',
      'kk': 'Курстар',
    },
    'aqs2sfc1': {
      'ru': 'Репетиторы',
      'kk': 'Тәрбиешілер',
    },
    'utg8ng2b': {
      'ru': 'Онлайн Обучение',
      'kk': 'Онлайн тренинг',
    },
    'kxjl428a': {
      'ru': 'Обучение за рубежом',
      'kk': 'Шет елде оқу',
    },
    'i8kkrwhz': {
      'ru': 'Работа за рубежом',
      'kk': 'Шетелде жұмыс істеу',
    },
    't8lkw3y5': {
      'ru': 'Акции',
      'kk': 'Қор',
    },
    '67vjft0e': {
      'ru': 'Рейтинг участников',
      'kk': 'Қатысушылар рейтингі',
    },
    '4gfbknoe': {
      'ru': 'Служба\nподдержки',
      'kk': '\nқолдау қызметі',
    },
    'ut2vf92w': {
      'ru': 'Новые олимпиады',
      'kk': 'Жаңа олимпиадалар',
    },
    'a1idwmq7': {
      'ru': 'Смотреть все ',
      'kk': 'Барлығын көру',
    },
    'w9pgp4ry': {
      'ru': 'Последние новости',
      'kk': 'Соңғы жаңалықтар',
    },
    'o9sus47s': {
      'ru': 'Смотреть все',
      'kk': 'Барлығын көру',
    },
    '89smnlyc': {
      'ru': 'Выдаем электронные сертификаты за участие',
      'kk': 'Қатысу үшін электронды сертификаттар береміз',
    },
    'grlfivr2': {
      'ru': 'Не упустите шанс выиграть путевку в жаркую страну',
      'kk': 'Ыстық елге саяхат ұтып алу мүмкіндігін жіберіп алмаңыз',
    },
    '9ah9qnkr': {
      'ru': 'Проходи олимпиады и турниры лучше остальных',
      'kk': 'Олимпиадалар мен турнирлерді басқаларға қарағанда жақсы аяқтаңыз',
    },
    '5qidbkrd': {
      'ru': 'Участвовать',
      'kk': 'Қатысу',
    },
    'xwr1no27': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    '3swsuurm': {
      'ru': '1 129',
      'kk': '1 129',
    },
    'cf2ma2ac': {
      'ru': 'Участников',
      'kk': 'Қатысушылар',
    },
    '1xcorohr': {
      'ru': '37',
      'kk': '37',
    },
    'gt0vie8a': {
      'ru': 'Олимпиад',
      'kk': 'Олимпиада',
    },
    'tddb0zt2': {
      'ru': '11',
      'kk': '11',
    },
    'f8j2agsz': {
      'ru': 'Предметов',
      'kk': 'Элементтер',
    },
    'l1ukr2kz': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    'vp0x7gsu': {
      'ru': 'Вход',
      'kk': 'Кіру',
    },
    '64y59brn': {
      'ru': 'Регистрация',
      'kk': 'Тіркеу',
    },
    'vhpgqpid': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    'erzdeos6': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    'dnwevexd': {
      'ru': 'Подробнее...',
      'kk': '',
    },
    '2ok9cifk': {
      'ru': 'Главная',
      'kk': 'үй',
    },
  },
  // ProfileInfo
  {
    'mbuo50l8': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'w9nvuqef': {
      'ru': 'Страница редактирования профиля',
      'kk': 'Профиль бетін өңдеу',
    },
    'w487l9bj': {
      'ru': 'Введите номер телефона',
      'kk': 'Телефон нөміріңізді енгізіңіз',
    },
    '1qg5qws8': {
      'ru': 'Дата рождения',
      'kk': 'туған күні',
    },
    '35a0ryle': {
      'ru': 'ИИН',
      'kk': 'ЖСН',
    },
    'kbcwjokh': {
      'ru': 'Имя',
      'kk': 'Аты',
    },
    'bbm0xyes': {
      'ru': 'Фамилия',
      'kk': 'Тегі',
    },
    'bzeddnom': {
      'ru': 'Название учебного заведения',
      'kk': 'Электрондық пошта',
    },
    '90bl9mxo': {
      'ru': 'Класс',
      'kk': '',
    },
    'fqiwj6py': {
      'ru': 'ФИО преподавателя',
      'kk': '',
    },
    'jmgxs0u5': {
      'ru': 'Сохранить',
      'kk': 'Сақтау',
    },
    'hzewzwt1': {
      'ru': 'Страница редактирования профиля',
      'kk': '',
    },
    'aibkizmt': {
      'ru': 'Изображение профиля*',
      'kk': '',
    },
    '9bgr0mlf': {
      'ru': 'Выбрать фото',
      'kk': '',
    },
    'xniqtcyt': {
      'ru': 'Имя*',
      'kk': '',
    },
    '46f5rf7w': {
      'ru': 'Имя',
      'kk': '',
    },
    'vxdjefo4': {
      'ru': 'Фамилия*',
      'kk': '',
    },
    'zi4z51os': {
      'ru': 'Фамилия',
      'kk': '',
    },
    'zy96l887': {
      'ru': 'Email*',
      'kk': '',
    },
    '6qhbomrt': {
      'ru': 'Email',
      'kk': '',
    },
    't473o4he': {
      'ru': 'ИИН ученика',
      'kk': '',
    },
    'jqnbsnpl': {
      'ru': 'ИИН ученика',
      'kk': '',
    },
    '42t6y0c4': {
      'ru': 'Дата рождения*',
      'kk': '',
    },
    'vh0nkggj': {
      'ru': 'Дата рождения',
      'kk': '',
    },
    '7f4rycg9': {
      'ru': 'Название учебного заведения*',
      'kk': '',
    },
    '9ix5ya37': {
      'ru': 'Название учебного заведения',
      'kk': '',
    },
    'bt6he7vi': {
      'ru': 'Класс*',
      'kk': '',
    },
    'yqkyo85f': {
      'ru': 'Класс',
      'kk': '',
    },
    'zj3kvyxb': {
      'ru': 'ФИО преподавателя*',
      'kk': '',
    },
    '2qxgnt2g': {
      'ru': 'ФИО преподавателя',
      'kk': '',
    },
    'qgvilszu': {
      'ru': 'Номер телефона ученика*',
      'kk': '',
    },
    '77z8p9ge': {
      'ru': 'Номер телефона ученика',
      'kk': '',
    },
    '4ratb4z4': {
      'ru': 'Сохранить',
      'kk': '',
    },
    'yhpilcut': {
      'ru': 'Field is required',
      'kk': '',
    },
    'g8nw6r1j': {
      'ru': 'Please choose an option from the dropdown',
      'kk': '',
    },
    'ufz7vsdl': {
      'ru': 'Field is required',
      'kk': '',
    },
    '43c8jdpg': {
      'ru': 'Please choose an option from the dropdown',
      'kk': '',
    },
    '7vyk8h0g': {
      'ru': 'Field is required',
      'kk': '',
    },
    'v7f95ex3': {
      'ru': 'Please choose an option from the dropdown',
      'kk': '',
    },
    'z0vkhdyw': {
      'ru': 'Field is required',
      'kk': '',
    },
    'xq0r2tyu': {
      'ru': 'Please choose an option from the dropdown',
      'kk': '',
    },
    'a17zdhms': {
      'ru': 'Field is required',
      'kk': '',
    },
    '82gx9ruj': {
      'ru': 'Please choose an option from the dropdown',
      'kk': '',
    },
    '9nynxo51': {
      'ru': 'Field is required',
      'kk': '',
    },
    'whamtutm': {
      'ru': 'Please choose an option from the dropdown',
      'kk': '',
    },
    '5m55n713': {
      'ru': 'Field is required',
      'kk': '',
    },
    '0stlkrnt': {
      'ru': 'Please choose an option from the dropdown',
      'kk': '',
    },
    'wbdw9imx': {
      'ru': 'Field is required',
      'kk': '',
    },
    'ka9bcdtb': {
      'ru': 'Please choose an option from the dropdown',
      'kk': '',
    },
    'zb6trss9': {
      'ru': 'Field is required',
      'kk': '',
    },
    '72zgdys4': {
      'ru': 'Please choose an option from the dropdown',
      'kk': '',
    },
    '610jd0ev': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // EditProfile
  {
    'q0mrlkzs': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'brl8ky9r': {
      'ru': 'Ваш аккаунт',
      'kk': 'Сіздің тіркелгіңіз',
    },
    'k4nla7j8': {
      'ru': 'Общая информация',
      'kk': 'жалпы ақпарат',
    },
    '82sdchmr': {
      'ru': 'Пополнение баланса',
      'kk': 'Балансыңызды толтырыңыз',
    },
    'hpri5wgg': {
      'ru': 'Рейтинги',
      'kk': 'Рейтингтер',
    },
    '2v7mp0ed': {
      'ru': 'Мои олимпиады',
      'kk': 'Менің олимпиадаларым',
    },
    'di2npgnt': {
      'ru': 'Новостная лента',
      'kk': 'Жаңалықтар тізімі',
    },
    'jljni9s8': {
      'ru': 'Реферальная ссылка',
      'kk': 'Анықтамалық сілтеме',
    },
    'to4xiqsv': {
      'ru': 'Мои уроки',
      'kk': 'Менің сабақтарым',
    },
    '5az200bn': {
      'ru': 'Выйти',
      'kk': 'Шығу',
    },
    '6d1uurpl': {
      'ru': 'Удалить аккаунт',
      'kk': 'Есептік жазбаны жою',
    },
    '9qo15zgc': {
      'ru': 'Мой аккаунт',
      'kk': '',
    },
    'xqrh9dwe': {
      'ru': 'Общая информация',
      'kk': '',
    },
    'osqgyvtx': {
      'ru':
          'Здесь вы можете редактировать информацию о своем профиле, внести изменения в контактные данные, фото и другие личные сведения.',
      'kk': '',
    },
    'xqjxquln': {
      'ru': 'Пополнение баланса',
      'kk': '',
    },
    '7b8ijgfk': {
      'ru':
          'На этой странице вы можете пополнить баланс вашего профиля, чтобы оплатить участие в олимпиадах и другие услуги.',
      'kk': '',
    },
    'a9491ha8': {
      'ru': 'Рейтинги',
      'kk': '',
    },
    'eiv3r76t': {
      'ru':
          'Здесь вы найдете общий рейтинг, отражающий вашу позицию по результатам участия во всех олимпиадах.',
      'kk': '',
    },
    'y1au9k42': {
      'ru': 'Мои олимпиады',
      'kk': '',
    },
    'ld0d18z3': {
      'ru':
          'На этой странице вы увидите список олимпиад, в которых вы участвовали, и ваше место в рейтинге по каждой из них.',
      'kk': '',
    },
    'gt993exz': {
      'ru': 'Новостная лента',
      'kk': '',
    },
    'k6mf0hxv': {
      'ru':
          'Здесь вы будете информированы о последних новостях и событиях, связанных с олимпиадами и вашим профилем.',
      'kk': '',
    },
    '6h21jf3t': {
      'ru': 'Профиль',
      'kk': 'Профиль',
    },
  },
  // ChooseRole
  {
    'l14m3e7d': {
      'ru': 'Для продолжения выберите свою роль',
      'kk': 'Жалғастыру үшін рөліңізді таңдаңыз',
    },
    '1g8gp4lm': {
      'ru': 'Школьник',
      'kk': 'Мектеп оқушысы',
    },
    'nwm39g39': {
      'ru': 'Учитель',
      'kk': 'Мұғалім',
    },
    'miw7ulws': {
      'ru': 'Родитель',
      'kk': 'Ата-ана',
    },
    'ucyekcko': {
      'ru': 'Партнер',
      'kk': 'Серіктес',
    },
    'mp2qibh6': {
      'ru': 'Репетитор',
      'kk': 'Тәрбиеші',
    },
    '4ebbg82x': {
      'ru': 'Выберите свою роль',
      'kk': 'Рөліңізді таңдаңыз',
    },
    'hg55b3nu': {
      'ru': 'Search for an item...',
      'kk': 'Элементті іздеу...',
    },
    'f51axwff': {
      'ru': 'Войти',
      'kk': 'Кіру үшін',
    },
    'w00y37md': {
      'ru': 'Выберите роль для продолжения',
      'kk': 'Жалғастыру үшін рөлді таңдаңыз',
    },
    '4geot1uy': {
      'ru': 'Я - ученик',
      'kk': 'Мен оқушымын',
    },
    '5gmh9f8b': {
      'ru': 'Я - учитель',
      'kk': 'Мен мұғаліммін',
    },
    'fbjikbzc': {
      'ru': 'Я - партнер',
      'kk': 'Мен серіктеспін',
    },
    '4xpkf21t': {
      'ru': 'Я - репетитор',
      'kk': 'Мен тәрбиешімін',
    },
    'jr8cm3gn': {
      'ru': 'Выбрать',
      'kk': 'Таңдау',
    },
    'pugidawj': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // payPage
  {
    'wnidjxpl': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'bv4a5y0a': {
      'ru': 'Пополнение баланса',
      'kk': 'Балансыңызды толтырыңыз',
    },
    'fe45hyt7': {
      'ru': 'Номер карты',
      'kk': 'Карта нөмірі',
    },
    'amzrgswt': {
      'ru': 'Срок действия карты',
      'kk': 'Картаның жарамдылық мерзімі',
    },
    'oa8jrddd': {
      'ru': 'CVV',
      'kk': 'CVV',
    },
    '78tmuxo3': {
      'ru': 'Оплатить',
      'kk': 'Төлеу',
    },
    '4srbvrbj': {
      'ru': 'Пополнение баланса',
      'kk': '',
    },
    'b19qerv2': {
      'ru': 'Номер карты',
      'kk': '',
    },
    'qdm0h70l': {
      'ru': 'Срок действия карты',
      'kk': '',
    },
    'dmcrc3ap': {
      'ru': 'CVV',
      'kk': '',
    },
    '65jue4ki': {
      'ru': 'Оплатить',
      'kk': '',
    },
    'xtuonbtp': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // TutorsN
  {
    'ouijxgqt': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    '2aj76sso': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    't33xmd8r': {
      'ru': 'Математика',
      'kk': '',
    },
    '0dzhmcdm': {
      'ru': 'Алгебра',
      'kk': '',
    },
    'uft6non9': {
      'ru': 'Геометрия',
      'kk': '',
    },
    'acc6kaup': {
      'ru': 'Русский',
      'kk': '',
    },
    'bllxrgjn': {
      'ru': 'Английский',
      'kk': '',
    },
    'vtsrjz03': {
      'ru': 'Русская литература',
      'kk': '',
    },
    'c8h6xy2a': {
      'ru': 'География',
      'kk': '',
    },
    'hcabc9nn': {
      'ru': 'Биология',
      'kk': '',
    },
    '7a18nheh': {
      'ru': 'История Казахстана',
      'kk': '',
    },
    'nbn93r0v': {
      'ru': 'Всемирная история',
      'kk': '',
    },
    'vng1xg0g': {
      'ru': 'Онлайн',
      'kk': '',
    },
    'hyawc75h': {
      'ru': 'Оффлайн',
      'kk': '',
    },
    'l7bb2s56': {
      'ru': 'Репетиторы',
      'kk': 'Тәрбиешілер',
    },
    '3qb28qhk': {
      'ru': 'Математика',
      'kk': '',
    },
    'p0qmmikp': {
      'ru': 'Алгебра',
      'kk': '',
    },
    'u17jtm6q': {
      'ru': 'Геометрия',
      'kk': '',
    },
    '1ph44rhf': {
      'ru': 'Русский',
      'kk': '',
    },
    '7mtekm01': {
      'ru': 'Английский',
      'kk': '',
    },
    'l89f9qm8': {
      'ru': 'Русская литература',
      'kk': '',
    },
    'ymu8mfrq': {
      'ru': 'География',
      'kk': '',
    },
    'ecry599t': {
      'ru': 'Биология',
      'kk': '',
    },
    'wpc1dy0p': {
      'ru': 'История Казахстана',
      'kk': '',
    },
    '5ru06d2f': {
      'ru': 'Всемирная история',
      'kk': '',
    },
    '4cdz6fhv': {
      'ru': 'Онлайн',
      'kk': '',
    },
    'm5cv2mzo': {
      'ru': 'Оффлайн',
      'kk': '',
    },
    'myqj2tx4': {
      'ru': 'О репетиторе',
      'kk': '',
    },
    'b6wwk0hk': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // quizPage
  {
    '2oub6swd': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'pdyh9ur2': {
      'ru': 'Тесты',
      'kk': 'Тесттер',
    },
    'jhztmvbb': {
      'ru': 'Результаты',
      'kk': 'нәтижелер',
    },
    'a0p9hcjj': {
      'ru': 'Тесты',
      'kk': 'Тесттер',
    },
    'c6jneqx5': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    '4j0fpk10': {
      'ru': 'Математика',
      'kk': 'Математика',
    },
    'rnv3968t': {
      'ru': 'Алгебра',
      'kk': 'Алгебра',
    },
    'uwz7ft1w': {
      'ru': 'Геометрия',
      'kk': 'Геометрия',
    },
    'xsi1r6jd': {
      'ru': 'Русский',
      'kk': 'орыс',
    },
    'w70so8wa': {
      'ru': 'Английский',
      'kk': 'Ағылшын',
    },
    'kraswbwv': {
      'ru': 'Русская Литература',
      'kk': 'Орыс әдебиеті',
    },
    'zj8w7eap': {
      'ru': 'География',
      'kk': 'География',
    },
    'excwet6m': {
      'ru': 'Биология',
      'kk': 'Биология',
    },
    'xf8cqkgy': {
      'ru': 'История Казахстана',
      'kk': 'Қазақстан тарихы',
    },
    'tkgd2dmc': {
      'ru': 'Всемирна история',
      'kk': 'Дүниежүзілік тарих',
    },
    '6egggwpe': {
      'ru': 'Здесь пока что ничего нет',
      'kk': 'Бұл жерде әлі ештеңе жоқ',
    },
    'e92bnwtk': {
      'ru': 'Зарегистрироваться',
      'kk': 'Тіркелу',
    },
    'pn7lwowt': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    '0ppcneaf': {
      'ru': 'Математика',
      'kk': '',
    },
    'gvkp5j76': {
      'ru': 'Алгебра',
      'kk': '',
    },
    'dbuuo6dy': {
      'ru': 'Геометрия',
      'kk': '',
    },
    'pvu7wf9u': {
      'ru': 'Русский',
      'kk': '',
    },
    'oliivtdg': {
      'ru': 'Английский',
      'kk': '',
    },
    'erbsylpr': {
      'ru': 'Русская литература',
      'kk': '',
    },
    'iag9d4jb': {
      'ru': 'География',
      'kk': '',
    },
    'i27tcwj5': {
      'ru': 'Биология',
      'kk': '',
    },
    'vrj1c6za': {
      'ru': 'История Казахстана',
      'kk': '',
    },
    'lefce3pd': {
      'ru': 'Всемирная история',
      'kk': '',
    },
    'bg7nqzqz': {
      'ru': 'Вход',
      'kk': 'Кіру',
    },
    'ms7hi55v': {
      'ru': 'Регистрация',
      'kk': 'Тіркеу',
    },
    '6z2rzca2': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    '3j9878yr': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // create_Quiz
  {
    '54n6c2ji': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'oitaoh0p': {
      'ru': 'Создать олимпиаду',
      'kk': 'Олимпиада құру',
    },
    'rflz5hzm': {
      'ru': 'Заполните информацию ниже для создание олимпиады для учащихся',
      'kk':
          'Оқушыларға арналған олимпиада құру үшін төмендегі ақпаратты толтырыңыз',
    },
    'yv8we356': {
      'ru': 'Название олимпиады',
      'kk': 'Олимпиаданың атауы',
    },
    'vbaoz3ku': {
      'ru': 'Краткое описание олимпиады и ее содержания',
      'kk': 'Олимпиаданың қысқаша сипаттамасы және оның мазмұны',
    },
    'atpeb0pq': {
      'ru': 'Цена',
      'kk': 'Бағасы',
    },
    'n40r30jv': {
      'ru': 'Дата начала',
      'kk': 'басталатын күн',
    },
    '4jdf60nd': {
      'ru': 'Дата окончания',
      'kk': 'мерзімнің өту күні',
    },
    'ccj9p8tq': {
      'ru': 'Язык',
      'kk': 'Тіл',
    },
    '2egl9aco': {
      'ru': 'Загрузить фотографию',
      'kk': 'Фотосуретті жүктеп салу үшін',
    },
    'hei7rxx5': {
      'ru': '1',
      'kk': '1',
    },
    'wykrovhx': {
      'ru': '2',
      'kk': '2',
    },
    '3jfa9m2a': {
      'ru': '3',
      'kk': '3',
    },
    'fyw8ffod': {
      'ru': '4',
      'kk': '4',
    },
    'o1jr8o0f': {
      'ru': '5',
      'kk': '5',
    },
    '4teuglhr': {
      'ru': '6',
      'kk': '6',
    },
    'b1fjprzi': {
      'ru': '7',
      'kk': '7',
    },
    's7691isp': {
      'ru': '8',
      'kk': '8',
    },
    'yuauuilp': {
      'ru': '9',
      'kk': '9',
    },
    'yqzxoce0': {
      'ru': '10',
      'kk': '10',
    },
    'mbox1hzf': {
      'ru': '11',
      'kk': 'он бір',
    },
    'dbd1tbqo': {
      'ru': 'Для какогого класса',
      'kk': 'Қай сыныпқа',
    },
    '385woub8': {
      'ru': 'Search for an item...',
      'kk': 'Элементті іздеу...',
    },
    '0ye5skq4': {
      'ru': 'Выберите предметы',
      'kk': 'Элементтерді таңдаңыз',
    },
    '49c2cncz': {
      'ru': 'Математика',
      'kk': 'Математика',
    },
    'i15rfi1d': {
      'ru': 'Алгебра',
      'kk': 'Алгебра',
    },
    'buarmvqe': {
      'ru': 'Геометрия',
      'kk': 'Геометрия',
    },
    '4a0o88nt': {
      'ru': 'Русский',
      'kk': 'орыс',
    },
    '7s0a5xxk': {
      'ru': 'Английский',
      'kk': 'Ағылшын',
    },
    'ayh33nuw': {
      'ru': 'Русская Литература',
      'kk': 'Орыс әдебиеті',
    },
    'ub8uptz5': {
      'ru': 'География',
      'kk': 'География',
    },
    '4ern65la': {
      'ru': 'Биология',
      'kk': 'Биология',
    },
    '7ihlbmct': {
      'ru': 'История Казахстана',
      'kk': 'Қазақстан тарихы',
    },
    'jph17aw6': {
      'ru': 'Всемирна история',
      'kk': 'Дүниежүзілік тарих',
    },
    '39o2qa4l': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'gm43qwkk': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '90u3ycy7': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'thw63x3n': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'je9d7lrk': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '0ahcl4os': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '1qr0lqx6': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'rdzcgsy5': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'm4mtkj9a': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'a0d927g7': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '251gnvks': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'bayzcjmv': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'fogklm8j': {
      'ru': 'Создать',
      'kk': 'Жасау',
    },
    'xy6whr8l': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // editQuestion
  {
    '4jpg2fq7': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    'jy71xsfu': {
      'ru': 'Редактировать вопрос',
      'kk': 'Сұрақты өңдеу',
    },
    'qv14sble': {
      'ru': 'Измените информацию ниже для редактирования вопроса',
      'kk': 'Сұрақты өңдеу үшін төмендегі ақпаратты өзгертіңіз',
    },
    'ecbc1b2j': {
      'ru': 'Question',
      'kk': 'Сұрақ',
    },
    'u3ukh1nl': {
      'ru': 'Short Description of what is going on...',
      'kk': 'Не болып жатқанының қысқаша сипаттамасы...',
    },
    'onyhhueu': {
      'ru': 'Варианты ответа',
      'kk': 'Жауап опциялары',
    },
    '5hdfqr9w': {
      'ru': 'Название варианта',
      'kk': 'Опция атауы',
    },
    'ydmyk9dd': {
      'ru': 'Please add an option name...',
      'kk': 'Опция атауын қосыңыз...',
    },
    '4n98f72i': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '5jeayg8v': {
      'ru': 'Выберите из опций снизу правильный ответ',
      'kk': 'Төмендегі опциялардан дұрыс жауапты таңдаңыз',
    },
    'vxjquwcz': {
      'ru': 'Правильный ответ',
      'kk': 'Дұрыс жауап',
    },
    '0j1fawz4': {
      'ru': 'Сохранить изменения',
      'kk': 'Өзгерістерді сақтау',
    },
    'fd21rabg': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // createQuestion
  {
    '6x4l901b': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    'xd5e1zc0': {
      'ru': 'Создать вопрос',
      'kk': 'Сұрақ құру',
    },
    'd5lblbf2': {
      'ru': 'Заполните информацию ниже для создания вопроса к тесту',
      'kk': 'Тест сұрағын құру үшін төмендегі ақпаратты толтырыңыз',
    },
    'cyvc65xx': {
      'ru': 'Вопрос',
      'kk': 'Сұрақ',
    },
    '86y6s7dz': {
      'ru': 'Краткое описание вопроса',
      'kk': 'Мәселенің қысқаша сипаттамасы',
    },
    'cncr5aka': {
      'ru': 'Варианты ответа',
      'kk': 'Жауап опциялары',
    },
    'xfdag9a5': {
      'ru': 'Название варианта',
      'kk': 'Опция атауы',
    },
    '93sgk4xb': {
      'ru': 'Please add an option name...',
      'kk': 'Опция атауын қосыңыз...',
    },
    '4qa7yumh': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'n3ltpb0j': {
      'ru': 'Выберите из опций снизу правильный ответ',
      'kk': 'Төмендегі опциялардан дұрыс жауапты таңдаңыз',
    },
    'zwayc07p': {
      'ru': 'Правильный ответ',
      'kk': 'Дұрыс жауап',
    },
    'tawvpzny': {
      'ru': 'Сохранить',
      'kk': 'Сақтау',
    },
    '683r4uuo': {
      'ru': 'Добавить вопрос',
      'kk': 'Сұрақ қосыңыз',
    },
    'i3872zi1': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // quiz_details
  {
    'avnqah5m': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'gt9byck0': {
      'ru': 'Прохождение олимпиады',
      'kk': 'Олимпиададан өту',
    },
    '3833p9oo': {
      'ru': 'Начать',
      'kk': 'БАСТА',
    },
    'csv0mhyz': {
      'ru': 'Опубликовать',
      'kk': 'Жариялау',
    },
    'hblp6yeu': {
      'ru': 'Прохождение олимпиады',
      'kk': '',
    },
    'ahtsyu78': {
      'ru': 'Начать',
      'kk': '',
    },
    '7x73y96c': {
      'ru': 'Опубликовать',
      'kk': '',
    },
    'i7bbi26v': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // quiz_QuestionDetails
  {
    'pm6as7r9': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'yaje1yv5': {
      'ru': '/',
      'kk': '/',
    },
    'xgvkisbv': {
      'ru': '/',
      'kk': '/',
    },
    'i3etbi8e': {
      'ru': 'Текущий результат: ',
      'kk': 'Ағымдағы нәтиже:',
    },
    'lsqjlvg8': {
      'ru': 'Отличная работа',
      'kk': 'Жақсы жұмыс',
    },
    '28r2p366': {
      'ru': 'Вы ответили правильно',
      'kk': 'Сіз дұрыс жауап бердіңіз',
    },
    's7lbcixt': {
      'ru': '+100 Points',
      'kk': '+100 ұпай',
    },
    'fz6kybhu': {
      'ru': 'Неправильно',
      'kk': 'Қате',
    },
    'gau5krdk': {
      'ru': 'Вы ответили неправильно',
      'kk': 'Сіз қате жауап бердіңіз',
    },
    '9d49jpk9': {
      'ru': 'Дальше',
      'kk': 'Әрі қарай',
    },
    'm16q5twx': {
      'ru': '/',
      'kk': '/',
    },
    'nnv0nu6m': {
      'ru': 'Текущий результат: ',
      'kk': 'Ағымдағы нәтиже:',
    },
    'nojhjir5': {
      'ru': 'Отличная работа',
      'kk': 'Жақсы жұмыс',
    },
    '6xpdm324': {
      'ru': 'Вы ответили правильно',
      'kk': 'Сіз дұрыс жауап бердіңіз',
    },
    'blc0fjmg': {
      'ru': '+100 Points',
      'kk': '+100 ұпай',
    },
    '1hjurq8w': {
      'ru': 'Неправильно',
      'kk': 'Қате',
    },
    'oy3j7qel': {
      'ru': 'Вы ответили неправильно',
      'kk': 'Сіз қате жауап бердіңіз',
    },
    'ndv4jzgt': {
      'ru': 'Дальше',
      'kk': 'Әрі қарай',
    },
    '6iwvanev': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // quizCompleteSummary
  {
    'srqmiabl': {
      'ru': 'Поздравляем',
      'kk': 'Құттықтаймыз',
    },
    'nyp1w0mo': {
      'ru': 'Спасибо за прохождение олимпиады',
      'kk': 'Олимпиаданы аяқтағандарыңызға рахмет',
    },
    '0jwxrx2u': {
      'ru': 'Из возможных ',
      'kk': 'Мүмкіндігінен',
    },
    'gh6j75is': {
      'ru': 'На главную',
      'kk': 'Негізгіге',
    },
    'bivd1xp2': {
      'ru': 'Поздравляем',
      'kk': 'Құттықтаймыз',
    },
    'rghjxlqa': {
      'ru': 'Спасибо за прохождение олимпиады',
      'kk': 'Олимпиаданы аяқтағандарыңызға рахмет',
    },
    '3o0i1aqq': {
      'ru': 'Из возможных ',
      'kk': 'Мүмкіндігінен',
    },
    'qo0tbzo4': {
      'ru': 'На главную',
      'kk': 'Негізгіге',
    },
    'auh4fvqg': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // Balance
  {
    'kfwu8ny7': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'pzj5930i': {
      'ru': 'Выберите сумму для пополнения баланса:',
      'kk': 'Балансыңызды толтыру үшін соманы таңдаңыз:',
    },
    '35t03nqb': {
      'ru': '500₸',
      'kk': '500₸',
    },
    '8ntngw0j': {
      'ru': '1000₸',
      'kk': '1000₸',
    },
    '6o6fwkvu': {
      'ru': '2000₸',
      'kk': '2000₸',
    },
    'fce6wtld': {
      'ru': '5000₸',
      'kk': '5000₸',
    },
    'tw17iwzb': {
      'ru': 'Хотите выбрать сумму сами? Введите значение в поле',
      'kk': '',
    },
    'yb63v2w2': {
      'ru': '',
      'kk': '',
    },
    'w8cr6tor': {
      'ru': '',
      'kk': '',
    },
    'zr27atz5': {
      'ru': '0',
      'kk': '',
    },
    'la9unh9y': {
      'ru': '₸',
      'kk': '',
    },
    '6njwcyhj': {
      'ru': 'Пополнить',
      'kk': 'Толықтыру',
    },
    'l4zcwzxp': {
      'ru': 'Выберите сумму для пополнения',
      'kk': 'Толықтыру үшін соманы таңдаңыз',
    },
    '5y7sybz8': {
      'ru': '500 ₸',
      'kk': '',
    },
    '01wpqt93': {
      'ru': '1000 ₸',
      'kk': '',
    },
    '17xoxp4h': {
      'ru': '2000 ₸',
      'kk': '',
    },
    'gr7hkufj': {
      'ru': '5000 ₸',
      'kk': '',
    },
    'as9hrbpr': {
      'ru': 'Хотите выбрать сумму сами? Введите значение в поле',
      'kk': '',
    },
    '3lf7fhk0': {
      'ru': '',
      'kk': '',
    },
    'ww5qm2es': {
      'ru': '',
      'kk': '',
    },
    '3iuikd9h': {
      'ru': '0',
      'kk': '',
    },
    'c2scijin': {
      'ru': '₸',
      'kk': '',
    },
    't67l5ama': {
      'ru': 'Пополнить баланс',
      'kk': '',
    },
    'jq7rcxec': {
      'ru': 'Профиль',
      'kk': 'Профиль',
    },
  },
  // MFeedBack
  {
    'avsm62db': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'imv7vppp': {
      'ru': 'Вы можете задать нам вопрос или ваше \nпредложение',
      'kk': 'Сіз бізге сұрақ немесе \nұсынысыңызды қоя аласыз',
    },
    'tyep2gdp': {
      'ru': 'Имя',
      'kk': 'Аты',
    },
    'bbeh99mp': {
      'ru': 'Электронная почта',
      'kk': 'Электрондық пошта',
    },
    'p1ot8f88': {
      'ru': 'Сообщение*',
      'kk': 'Хабар*',
    },
    'x4yeemrc': {
      'ru': 'Ваш вопрос или предложение',
      'kk': 'Сіздің сұрағыңыз немесе ұсынысыңыз',
    },
    'gfzhtk3k': {
      'ru': 'Отправить',
      'kk': 'Жіберу',
    },
    'w2oyn0yi': {
      'ru': 'Служба поддержки',
      'kk': 'Қолдау қызметі',
    },
    '7rnycf9p': {
      'ru': 'Имя *',
      'kk': 'Аты *',
    },
    'fojy8yg6': {
      'ru': '',
      'kk': 'Электрондық пошта',
    },
    'v9qov88m': {
      'ru': 'Email *',
      'kk': 'Электрондық пошта *',
    },
    '62qnycpj': {
      'ru': '',
      'kk': 'Құпия сөз',
    },
    '63a9clbf': {
      'ru': 'Опишите вашу проблему *',
      'kk': 'Мәселеңізді сипаттаңыз *',
    },
    '053q46gp': {
      'ru': 'Выбрать файл',
      'kk': 'Файлды таңдаңыз',
    },
    'g243s5y1': {
      'ru': 'Отправить',
      'kk': 'Жіберу',
    },
    'toru84xj': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // aboarStudy
  {
    '2xmihtrg': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    '6xb2hmos': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    '8up1vnlt': {
      'ru': 'Россия',
      'kk': 'Ресей',
    },
    'ta1q6sh8': {
      'ru': 'США',
      'kk': 'АҚШ',
    },
    'rz6kygfy': {
      'ru': 'Латвия',
      'kk': 'Латвия',
    },
    'bep7too5': {
      'ru': 'Турция',
      'kk': 'Түркия',
    },
    '0xmuvdea': {
      'ru': 'Германия',
      'kk': 'Германия',
    },
    'u5qxh8rp': {
      'ru': 'Выберите страну',
      'kk': 'Елді таңдаңыз',
    },
    'g6dgmvet': {
      'ru': 'Search for an item...',
      'kk': 'Элементті іздеу...',
    },
    'a03p6gon': {
      'ru': 'Обучение за рубежом',
      'kk': 'Шет елде оқу',
    },
    'msf7l6c5': {
      'ru': 'США',
      'kk': '',
    },
    '7qwskywh': {
      'ru': 'Великобритания',
      'kk': '',
    },
    'mhhztnbe': {
      'ru': 'Канада',
      'kk': '',
    },
    'j0jia2gz': {
      'ru': 'Австралия',
      'kk': '',
    },
    'qllq65zz': {
      'ru': 'Германия',
      'kk': '',
    },
    'a9sidljk': {
      'ru': 'Франция',
      'kk': '',
    },
    '4lvpdr92': {
      'ru': 'Нидерланды',
      'kk': '',
    },
    'wcplscxr': {
      'ru': 'Швеция',
      'kk': '',
    },
    '5pz3z5c9': {
      'ru': 'Япония',
      'kk': '',
    },
    'b4v7x6dr': {
      'ru': 'Швейцария',
      'kk': '',
    },
    'wbvw5kz5': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    'ocvlteuy': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // abroadWork
  {
    'sbbm8w70': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    '6egbl53f': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'y6y72b2x': {
      'ru': 'Россия',
      'kk': 'Ресей',
    },
    'l7sgylqp': {
      'ru': 'США',
      'kk': 'АҚШ',
    },
    'rx3e0lkg': {
      'ru': 'Латвия',
      'kk': 'Латвия',
    },
    'jobmd3mq': {
      'ru': 'Турция',
      'kk': 'Түркия',
    },
    'htpakavd': {
      'ru': 'Германия',
      'kk': 'Германия',
    },
    'o8qs0s0i': {
      'ru': 'Выберите страну',
      'kk': 'Елді таңдаңыз',
    },
    'jrlfxxor': {
      'ru': 'Search for an item...',
      'kk': 'Элементті іздеу...',
    },
    'ig9dhf28': {
      'ru': 'Работа за рубежом',
      'kk': 'Шетелде жұмыс істеу',
    },
    'whigntgm': {
      'ru': 'США',
      'kk': '',
    },
    '98cyk1ch': {
      'ru': 'Великобритания',
      'kk': '',
    },
    'tehbtj9i': {
      'ru': 'Канада',
      'kk': '',
    },
    'rzt4z8jo': {
      'ru': 'Австралия',
      'kk': '',
    },
    's62acxp0': {
      'ru': 'Германия',
      'kk': '',
    },
    'sd4g3kgw': {
      'ru': 'Франция',
      'kk': '',
    },
    'xcgc6oh1': {
      'ru': 'Нидерланды',
      'kk': '',
    },
    'c7vwga7i': {
      'ru': 'Швеция',
      'kk': '',
    },
    'rtmcd2da': {
      'ru': 'Япония',
      'kk': '',
    },
    'ac8y1mx3': {
      'ru': 'Швейцария',
      'kk': '',
    },
    'sxntkb82': {
      'ru': 'Подробнее о вакансии',
      'kk': 'Бос орын туралы қосымша ақпарат',
    },
    'krj2pvu2': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // onlineStudy
  {
    'bsxwf9q9': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'vcuglrg2': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'vqop2g01': {
      'ru': 'Онлайн-обучение',
      'kk': 'Онлайн тренинг',
    },
    'nu2e7e4n': {
      'ru': 'Математика',
      'kk': '',
    },
    'ihl52es0': {
      'ru': 'Алгебра',
      'kk': '',
    },
    'hwtt7e0r': {
      'ru': 'Геометрия',
      'kk': '',
    },
    'zezj0q58': {
      'ru': 'Русский',
      'kk': '',
    },
    'n5kn73ed': {
      'ru': 'Английский',
      'kk': '',
    },
    '0ghpzziu': {
      'ru': 'Русская литература',
      'kk': '',
    },
    '2hb138w8': {
      'ru': 'География',
      'kk': '',
    },
    '7wh2yj24': {
      'ru': 'Биология',
      'kk': '',
    },
    '5d26xnqa': {
      'ru': 'История Казахстана',
      'kk': '',
    },
    '5fr2qade': {
      'ru': 'Всемирная история',
      'kk': '',
    },
    'm0v2o81i': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    'oxiou7el': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // promotionsN
  {
    'ut0ojxsr': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'w2mim3vo': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    '94l5s516': {
      'ru': 'Акции',
      'kk': 'Қор',
    },
    '1nsfp4fb': {
      'ru': 'Получить скидку',
      'kk': '',
    },
    'y3roi4ho': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // ratings
  {
    'deuj1lxn': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    '9i3w4ui3': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'yc346vxk': {
      'ru': 'Участники олимпиады',
      'kk': 'Олимпиада қатысушылары',
    },
    '100rf324': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // quizPageRatingsDODELAT
  {
    'f6543qk2': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'puz6rarv': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    's9u6ankt': {
      'ru': 'Математика',
      'kk': 'Математика',
    },
    'ss6dp04w': {
      'ru': 'Алгебра',
      'kk': 'Алгебра',
    },
    '4exxvvzz': {
      'ru': 'Геометрия',
      'kk': 'Геометрия',
    },
    'jbfxcmy2': {
      'ru': 'Русский',
      'kk': 'орыс',
    },
    'pbq4qoic': {
      'ru': 'Английский',
      'kk': 'Ағылшын',
    },
    '96dyezpy': {
      'ru': 'Русская Литература',
      'kk': 'Орыс әдебиеті',
    },
    'f1qs9vvp': {
      'ru': 'География',
      'kk': 'География',
    },
    '8gia4eal': {
      'ru': 'Биология',
      'kk': 'Биология',
    },
    '5246zhbd': {
      'ru': 'История Казахстана',
      'kk': 'Қазақстан тарихы',
    },
    'e6ub8p13': {
      'ru': 'Всемирна история',
      'kk': 'Дүниежүзілік тарих',
    },
    'ln5jredv': {
      'ru': 'Рейтинги олимпиад',
      'kk': 'Олимпиада рейтингтері',
    },
    '54tsf4b9': {
      'ru': 'Математика',
      'kk': '',
    },
    'fk97vu95': {
      'ru': 'Алгебра',
      'kk': '',
    },
    '71g36vdl': {
      'ru': 'Геометрия',
      'kk': '',
    },
    'r43q6z2r': {
      'ru': 'Русский',
      'kk': '',
    },
    '0yvr7inn': {
      'ru': 'Английский',
      'kk': '',
    },
    'p4nrd27c': {
      'ru': 'Русская Литература',
      'kk': '',
    },
    'se1qo0gb': {
      'ru': 'География',
      'kk': '',
    },
    'kxpx3v06': {
      'ru': 'Биология',
      'kk': '',
    },
    'n2ws2xfk': {
      'ru': 'История Казахстана',
      'kk': '',
    },
    '8fa60vac': {
      'ru': 'Всемирна история',
      'kk': '',
    },
    '70qcwots': {
      'ru': 'Подробнее',
      'kk': '',
    },
    '9xvfc7hw': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // TournirsList
  {
    'og8hruzl': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'x2z3gcue': {
      'ru': 'Турниры',
      'kk': 'Турнирлер',
    },
    'wvfp0gi6': {
      'ru': 'Мои турниры',
      'kk': 'Менің турнирлерім',
    },
    'jw2c1b5j': {
      'ru': 'Турниры',
      'kk': 'Турнирлер',
    },
    'ja50o7kl': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'srfzk43a': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // tournirConfirm
  {
    'uxdmogfd': {
      'ru': 'Вы действительно хотите принять участие в турнире?',
      'kk': 'Турнирге шынымен қатысқыңыз келе ме?',
    },
    'n3w3b0j5': {
      'ru': 'Отмена',
      'kk': 'Болдырмау',
    },
    '49glfwg0': {
      'ru': 'Подтвердить',
      'kk': 'Растау',
    },
    'erf920ry': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // create_Tournament
  {
    'vn2lk2ir': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    'swbzni2a': {
      'ru': 'Создать турнир',
      'kk': 'Турнир жасаңыз',
    },
    'wzytd070': {
      'ru': 'Заполните информацию ниже для создание турнира для учащихся',
      'kk': 'Оқушыларға турнир құру үшін төмендегі ақпаратты толтырыңыз',
    },
    'swh4dj22': {
      'ru': 'Название турнира',
      'kk': 'Турнир атауы',
    },
    '2ml2t6z9': {
      'ru': 'Краткое описание турнира и ее содержания',
      'kk': 'Турнирдің қысқаша сипаттамасы және оның мазмұны',
    },
    '7sghqork': {
      'ru': 'Дата окончания',
      'kk': 'мерзімнің өту күні',
    },
    'kzz5or2v': {
      'ru': '1',
      'kk': '1',
    },
    'ogc175cn': {
      'ru': '2',
      'kk': '2',
    },
    '3ydvdj6b': {
      'ru': '3',
      'kk': '3',
    },
    'uf56ro71': {
      'ru': '4',
      'kk': '4',
    },
    'vr5b8c9b': {
      'ru': '5',
      'kk': '5',
    },
    '4svga295': {
      'ru': '6',
      'kk': '6',
    },
    'oyb7og41': {
      'ru': '7',
      'kk': '7',
    },
    'cjken0fm': {
      'ru': '8',
      'kk': '8',
    },
    'oyha1vex': {
      'ru': '9',
      'kk': '9',
    },
    'mvt6sgxz': {
      'ru': '10',
      'kk': '10',
    },
    'hmqcxzlu': {
      'ru': '11',
      'kk': 'он бір',
    },
    'q7hrqh4o': {
      'ru': 'Для какогого класса',
      'kk': 'Қай сыныпқа',
    },
    'xy3f7rsw': {
      'ru': 'Search for an item...',
      'kk': 'Элементті іздеу...',
    },
    'ntz318e9': {
      'ru': 'Создать',
      'kk': 'Жасау',
    },
    'lomrkpdu': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // News
  {
    '2bdqrjap': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'pxefsxik': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    'dogm05c1': {
      'ru': 'News',
      'kk': 'Үй',
    },
  },
  // Admin
  {
    '518xtj4s': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    '6pb751wd': {
      'ru': 'Ваш аккаунт',
      'kk': 'Сіздің тіркелгіңіз',
    },
    'aqlpyemt': {
      'ru': 'Добавить олимпиаду',
      'kk': 'Олимпиаданы қосыңыз',
    },
    'ahgv1l6e': {
      'ru': 'Олимпиады добавленные мною',
      'kk': 'Олимпиада мен қосқан',
    },
    'k91zobhg': {
      'ru': 'Добавить новость',
      'kk': 'Жаңалық қосу',
    },
    '7kvrwd0g': {
      'ru': 'Добавить курс',
      'kk': 'Курс қосыңыз',
    },
    'f5hq97ek': {
      'ru': 'Добавить репетитор',
      'kk': 'Тәрбиешіні қосыңыз',
    },
    'jj1tfgou': {
      'ru': 'Добавить онлайн-обучение',
      'kk': 'Онлайн оқытуды қосыңыз',
    },
    '30h6wkcx': {
      'ru': 'Добавить обучение за рубежом',
      'kk': 'Шетелде оқуды қосыңыз',
    },
    '2hh6xwhy': {
      'ru': 'Добавить работу за рубежом',
      'kk': 'Шетелде жұмыс қосыңыз',
    },
    '9vyd7o1j': {
      'ru': 'Добавить турнир',
      'kk': 'Турнир қосыңыз',
    },
    'mi3p57aa': {
      'ru': 'Добавить акцию',
      'kk': 'Жарнама қосу',
    },
    'g8ku7t5n': {
      'ru': 'Выйти',
      'kk': 'Шығу',
    },
    'j8u8p19b': {
      'ru': 'Удалить аккаунт',
      'kk': 'Есептік жазбаны жою',
    },
    'e0ebk6oz': {
      'ru': 'Профиль',
      'kk': 'Профиль',
    },
  },
  // adminsOlimp
  {
    'tg7q1ub9': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    's57ihq2a': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'r4unjhf4': {
      'ru': 'Здесь пока что ничего нет',
      'kk': 'Бұл жерде әлі ештеңе жоқ',
    },
    'nsydwwpa': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // AdminPromotions
  {
    '00dbtfuw': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    'algvy7gt': {
      'ru': 'Страница добавления/редактирования акций',
      'kk': 'Жарнамаларды қосу/өңдеу беті',
    },
    'pwzqqw4f': {
      'ru': 'Введите название акции',
      'kk': 'Науқанның атын енгізіңіз',
    },
    'ot40m4zf': {
      'ru': 'Введите дату окончания акции',
      'kk': 'Науқанның аяқталу күнін енгізіңіз',
    },
    'azgyhnuf': {
      'ru': 'Описание акции',
      'kk': 'Науқанның сипаттамасы',
    },
    '021zvsaz': {
      'ru': 'Загрузить фотографию',
      'kk': 'Фотосуретті жүктеп салу үшін',
    },
    'bj1rvgxi': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'pbym0fxh': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '84zaxgq3': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '44qgkik6': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'fxb64wud': {
      'ru': 'Сохранить',
      'kk': 'Сақтау',
    },
    'md2ukcqn': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // AdminNews
  {
    'gamx4moe': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    '5hvn2tix': {
      'ru': 'Страница добавления/редактирования новостей',
      'kk': 'Жаңалықтарды қосу/өңдеу беті',
    },
    'lbrdu9zw': {
      'ru': 'Введите заголовок новости',
      'kk': 'Жаңалық атауын енгізіңіз',
    },
    'uhedb2p2': {
      'ru': 'Описание новости',
      'kk': 'Жаңалықтың сипаттамасы',
    },
    'uhwxr5vy': {
      'ru': 'Загрузить фотографию',
      'kk': 'Фотосуретті жүктеп салу үшін',
    },
    't86yzxq6': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'ogz35dxe': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'amcj03um': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'wvnbadmk': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'qko06t2a': {
      'ru': 'Сохранить',
      'kk': 'Сақтау',
    },
    'g49ywbco': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // AdminCourses
  {
    'znneb5ds': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    '9w0ub567': {
      'ru': 'Страница добавления/редактирования курсов',
      'kk': 'Курстарды қосу/өңдеу беті',
    },
    'cvroxbv4': {
      'ru': 'Введите название уч. заведения',
      'kk': 'Есептік жазбаның атын енгізіңіз. мекемелер',
    },
    'eoy1iec2': {
      'ru': 'Стоимость курса',
      'kk': 'Курс ақысы',
    },
    '23fj9i8s': {
      'ru': 'Введите название курса',
      'kk': 'Курс атын енгізіңіз',
    },
    '4tzsl1rt': {
      'ru': 'Номер телефона',
      'kk': 'Телефон нөмірі',
    },
    '3m7w20a5': {
      'ru': 'Методика',
      'kk': 'Әдістеме',
    },
    'swzvu6y4': {
      'ru': 'Для кого',
      'kk': 'Кім үшін',
    },
    '1hcvpvlx': {
      'ru': 'Зачем',
      'kk': 'Не үшін',
    },
    'x0hdp6cg': {
      'ru': 'Описание курса',
      'kk': 'Курс сипаттамасы',
    },
    '6afjc9aq': {
      'ru': 'Предметы репетитора',
      'kk': 'Тәрбиеші пәндері',
    },
    '6x1eqogh': {
      'ru': 'Математика',
      'kk': 'Математика',
    },
    'y178fll2': {
      'ru': 'Алгебра',
      'kk': 'Алгебра',
    },
    'mqqb725h': {
      'ru': 'Геометрия',
      'kk': 'Геометрия',
    },
    'x1k00psg': {
      'ru': 'Русский',
      'kk': 'орыс',
    },
    'l3qmesdg': {
      'ru': 'Английский',
      'kk': 'Ағылшын',
    },
    'v9uqbdd9': {
      'ru': 'Русская Литература',
      'kk': 'Орыс әдебиеті',
    },
    'lq73n2vb': {
      'ru': 'География',
      'kk': 'География',
    },
    'smtq2431': {
      'ru': 'Биология',
      'kk': 'Биология',
    },
    'zpqgokht': {
      'ru': 'История Казахстана',
      'kk': 'Қазақстан тарихы',
    },
    'x5pxvwms': {
      'ru': 'Всемирна история',
      'kk': 'Дүниежүзілік тарих',
    },
    'qlzzh32z': {
      'ru': 'Загрузить фотографию',
      'kk': 'Фотосуретті жүктеп салу үшін',
    },
    'cnx0a787': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'k5i5fxh6': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'mjumb5dm': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '11a9ldfb': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'lrwztacy': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '21tpglpy': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '9o86sr3e': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'sfolqk0c': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '43cxoilb': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'f93f86bg': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'hv93oj13': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '76oalebb': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '07ggezbn': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'p2pmbolv': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '859soknn': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'dcugyiu0': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '92uzax55': {
      'ru': 'Сохранить',
      'kk': 'Сақтау',
    },
    'r4ubzzuc': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // AdminTutors
  {
    'jesyamjo': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    'tnb8py70': {
      'ru': 'Страница добавления/редактирования репетиторов',
      'kk': 'Оқытушыларды қосу/өңдеу беті',
    },
    'ftdy9gim': {
      'ru': 'Введите ваше ФИО',
      'kk': 'Толық аты-жөніңізді енгізіңіз',
    },
    'iyl55i1s': {
      'ru': 'Предметы репетитора',
      'kk': 'Тәрбиеші пәндері',
    },
    'w4kwwd54': {
      'ru': 'Математика',
      'kk': 'Математика',
    },
    'lolwcxts': {
      'ru': 'Алгебра',
      'kk': 'Алгебра',
    },
    'hxet8sn2': {
      'ru': 'Геометрия',
      'kk': 'Геометрия',
    },
    '3y22wcc0': {
      'ru': 'Русский',
      'kk': 'орыс',
    },
    'w912jutu': {
      'ru': 'Английский',
      'kk': 'Ағылшын',
    },
    'o1i7r4ne': {
      'ru': 'Русская Литература',
      'kk': 'Орыс әдебиеті',
    },
    '8ie68y54': {
      'ru': 'География',
      'kk': 'География',
    },
    'sbh9f3ea': {
      'ru': 'Биология',
      'kk': 'Биология',
    },
    '3xo55ky5': {
      'ru': 'История Казахстана',
      'kk': 'Қазақстан тарихы',
    },
    '04zhl1ec': {
      'ru': 'Всемирна история',
      'kk': 'Дүниежүзілік тарих',
    },
    'zk75wpmr': {
      'ru': 'Описание репетитора',
      'kk': 'Оқытушы сипаттамасы',
    },
    'd9djhmso': {
      'ru': 'Цена за одно занятие',
      'kk': 'Бір сабақтың бағасы',
    },
    'gi62apj8': {
      'ru': 'Номер телефона репетитора',
      'kk': 'Тәрбиешінің телефон нөмірі',
    },
    'mw80neeh': {
      'ru': 'Длительность занятия',
      'kk': 'Сабақтың ұзақтығы',
    },
    '5s1a2t6p': {
      'ru': 'Формат',
      'kk': 'Формат',
    },
    'wjb0zbm6': {
      'ru': 'Для кого',
      'kk': 'Кім үшін',
    },
    'fc0sa0mf': {
      'ru': 'Загрузить фотографию',
      'kk': 'Фотосуретті жүктеп салу үшін',
    },
    '4w1cv0iw': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'l72tm913': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '449qzuqz': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '4r88aizj': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '4y0hef90': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'w7in6hmf': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'f59l2ph9': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'd8ajcomn': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '2gs22kp4': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'rafk2spu': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'kpiszl5r': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'dwldgc85': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'gcvvv3r1': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'nxlj77r9': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'cv98uzrw': {
      'ru': 'Сохранить',
      'kk': 'Сақтау',
    },
    'hn1qd5p9': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // Courses
  {
    '1gqrh546': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'y8l6sx95': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'vk94tlv1': {
      'ru': 'Курсы',
      'kk': 'Курстар',
    },
    'itoq0f5s': {
      'ru': 'Математика',
      'kk': '',
    },
    'owplgdp6': {
      'ru': 'Алгебра',
      'kk': '',
    },
    'k5qlrhux': {
      'ru': 'Геометрия',
      'kk': '',
    },
    'rd947xxy': {
      'ru': 'Русский',
      'kk': '',
    },
    '7crfv5wm': {
      'ru': 'Английский',
      'kk': '',
    },
    'hk8q25cg': {
      'ru': 'Русская литература',
      'kk': '',
    },
    'vu75j0wo': {
      'ru': 'География',
      'kk': '',
    },
    '4e6h6ckn': {
      'ru': 'Биология',
      'kk': '',
    },
    '6uy7z814': {
      'ru': 'История Казахстана',
      'kk': '',
    },
    'l7pa1a6u': {
      'ru': 'Всемирная история',
      'kk': '',
    },
    '1kmvsr5e': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    '3f9u27bu': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // AdminAbroadStudy
  {
    'uj52yh8j': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    'vakoahgn': {
      'ru': 'Страница добавления/редактирования обучения зарубежом',
      'kk': 'Шетелде оқуды қосу/өңдеу беті',
    },
    'ms6bw1fg': {
      'ru': 'Введите название',
      'kk': 'Тақырыпты енгізіңіз',
    },
    'mcumidlv': {
      'ru': 'Описание учебы ',
      'kk': 'Оқу сипаттамасы',
    },
    'ps98y0x1': {
      'ru': 'Введите страну обучения',
      'kk': 'Оқыған еліңізді енгізіңіз',
    },
    'niafnf4u': {
      'ru': 'Введите город обучения',
      'kk': 'Оқу қалаңызды енгізіңіз',
    },
    'peg5p089': {
      'ru': 'Введите стоимость обучения',
      'kk': 'Оқу ақысын енгізіңіз',
    },
    'pcl38pez': {
      'ru': 'Введите название учебного заведения',
      'kk': 'Оқу орнының атын енгізіңіз',
    },
    'enn6v7dm': {
      'ru': 'Введите контактный номер',
      'kk': 'Байланыс нөмірін енгізіңіз',
    },
    'ejffikie': {
      'ru': 'Загрузить фотографию',
      'kk': 'Фотосуретті жүктеп салу үшін',
    },
    'yp18klfv': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'vz4xu07r': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '8sgntu5z': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'cmdree4p': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'c37floeq': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '3juwfxr2': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'yjuz1bqg': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '5r1o6auv': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'jfzxb9cp': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'uqh47pu2': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '2q1mt56j': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '5kfctvcq': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '5rygutzk': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'bhp4c6ss': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'o8riekr5': {
      'ru': 'Сохранить',
      'kk': 'Сақтау',
    },
    'n63msmnm': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // AdminAbroadWork
  {
    '9cujmb2k': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    'bj6h51od': {
      'ru': 'Страница добавления/редактирования работы зарубежом',
      'kk': 'Шетелде жұмысты қосу/өңдеу беті',
    },
    'fw7kgmyn': {
      'ru': 'Введите название',
      'kk': 'Тақырыпты енгізіңіз',
    },
    '9l2rmvfa': {
      'ru': 'Описание работы',
      'kk': 'Жұмыс сипаттамасы',
    },
    'hzm1k76l': {
      'ru': 'Введите страну работы',
      'kk': 'Жұмыс істейтін еліңізді енгізіңіз',
    },
    'u4x0or1z': {
      'ru': 'Введите город работы',
      'kk': 'Жұмыс қалаңызды енгізіңіз',
    },
    'xzkdlzjw': {
      'ru': 'Введите зарплату',
      'kk': 'Жалақыны енгізіңіз',
    },
    'wc46mlui': {
      'ru': 'Введите контактный номер',
      'kk': 'Байланыс нөмірін енгізіңіз',
    },
    'u48rxsrv': {
      'ru': 'Загрузить фотографию',
      'kk': 'Фотосуретті жүктеп салу үшін',
    },
    'vhebjj78': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'tuqcgenm': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '2jwnlg14': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'orjhy1xf': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'vqtord1a': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'wy05dy10': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'ehou11c4': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '5c87k752': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'vm3nckj7': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '1epc4cw7': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'cmmu07bk': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'a6qhu7pn': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '0ha72khl': {
      'ru': 'Сохранить',
      'kk': 'Сақтау',
    },
    'l6hn78gc': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // AdminOnlineStudy
  {
    'trpcjff8': {
      'ru': 'user',
      'kk': 'пайдаланушы',
    },
    'z81bgudm': {
      'ru': 'Страница добавления/редактирования обучения онлайн',
      'kk': 'Онлайн оқыту бетін қосу/өңдеу',
    },
    'a4p1lqcv': {
      'ru': 'Введите название',
      'kk': 'Тақырыпты енгізіңіз',
    },
    'jwsojsuo': {
      'ru': 'Описание учебы ',
      'kk': 'Оқу сипаттамасы',
    },
    'sgzhod9v': {
      'ru': 'Введите методику обучения',
      'kk': 'Оқыту әдісін енгізіңіз',
    },
    '2jrlmc74': {
      'ru': 'Введите стоимость обучения',
      'kk': 'Оқу ақысын енгізіңіз',
    },
    '41568nwi': {
      'ru': 'Введите контактный номер',
      'kk': 'Байланыс нөмірін енгізіңіз',
    },
    '2ph35qxr': {
      'ru': 'Введите учебное заведение',
      'kk': 'Сіздің оқу орныңызға кіріңіз',
    },
    's87mhlee': {
      'ru': 'Загрузить фотографию',
      'kk': 'Фотосуретті жүктеп салу үшін',
    },
    'bofxkghc': {
      'ru': 'Предметы обучения',
      'kk': 'Зерттеу пәндері',
    },
    '10qurw8b': {
      'ru': 'Математика',
      'kk': 'Математика',
    },
    'fqtdk3lw': {
      'ru': 'Алгебра',
      'kk': 'Алгебра',
    },
    'kcm0jg9o': {
      'ru': 'Геометрия',
      'kk': 'Геометрия',
    },
    'yri6jppo': {
      'ru': 'Русский',
      'kk': 'орыс',
    },
    'mw3vu6gm': {
      'ru': 'Английский',
      'kk': 'Ағылшын',
    },
    '74cbnxae': {
      'ru': 'Русская Литература',
      'kk': 'Орыс әдебиеті',
    },
    '9fsr5nxg': {
      'ru': 'География',
      'kk': 'География',
    },
    'kzhu2cpu': {
      'ru': 'Биология',
      'kk': 'Биология',
    },
    '4txh3nmt': {
      'ru': 'История Казахстана',
      'kk': 'Қазақстан тарихы',
    },
    'j35qe4e9': {
      'ru': 'Всемирна история',
      'kk': 'Дүниежүзілік тарих',
    },
    'hws8p4rv': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'cx3cs5ob': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    '41opp4p8': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'us0n3kz0': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    't95ljorr': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'ob4n73sv': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'ktya7h1q': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    '4tc69ksp': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'gymxkr6o': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'k9il0aao': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'fmarnzhr': {
      'ru': 'Field is required',
      'kk': 'Өріс қажет',
    },
    'inalov7b': {
      'ru': 'Please choose an option from the dropdown',
      'kk': 'Ашылмалы тізімнен опцияны таңдаңыз',
    },
    'x7hgx3be': {
      'ru': 'Сохранить',
      'kk': 'Сақтау',
    },
    'stf8e34s': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // buyQuiz
  {
    'a2hjbuoz': {
      'ru': 'Вы действительно хотите купить тест за',
      'kk': 'Сіз шынымен сынақты сатып алғыңыз келе ме?',
    },
    'qq7kjhb1': {
      'ru': 'Отмена',
      'kk': 'Болдырмау',
    },
    'm51s2cdk': {
      'ru': 'Подтвердить',
      'kk': 'Растау',
    },
    't6tsqa6n': {
      'ru': 'Вы действительно хотите купить тест за',
      'kk': 'Сіз шынымен сынақты сатып алғыңыз келе ме?',
    },
    '3fcbhdzt': {
      'ru': 'Отмена',
      'kk': 'Болдырмау',
    },
    'txaqfh8y': {
      'ru': 'Подтвердить',
      'kk': 'Растау',
    },
    '91gwubzd': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // NewsDetail
  {
    'jlsalefe': {
      'ru': 'Описание:',
      'kk': 'Сипаттама:',
    },
    'wikbl5hw': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    's4ft1sfo': {
      'ru': 'Дата публикации:',
      'kk': 'Жарияланған күні:',
    },
    'ieo7rg00': {
      'ru': 'Описание',
      'kk': 'Сипаттама',
    },
    'f3hyzlr3': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // OlimpDetail
  {
    'pextnvsf': {
      'ru': 'Для школьников',
      'kk': 'Мектеп оқушыларына',
    },
    'm0lcslur': {
      'ru': 'Дата начала:',
      'kk': 'Басталатын күн:',
    },
    '9mgvnqyy': {
      'ru': 'Дата окончания:',
      'kk': 'Мерзімнің өту күні:',
    },
    'g08g6ed6': {
      'ru': 'Язык олимпиады',
      'kk': 'Олимпиаданың тілі',
    },
    'eqeswvr2': {
      'ru': 'Стоимость участия:',
      'kk': 'Қатысу құны:',
    },
    'kdfmy5j8': {
      'ru': 'Начать ',
      'kk': 'БАСТА',
    },
    '7momnps7': {
      'ru': 'Список лидеров',
      'kk': 'Көшбасшылар тақтасы',
    },
    'vh6ebq19': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'mo369ggx': {
      'ru': 'Дата начала:',
      'kk': '',
    },
    'rdsviixa': {
      'ru': 'Дата окончания:',
      'kk': '',
    },
    'x2ra0cc8': {
      'ru': 'Цена:',
      'kk': '',
    },
    'hdqmef1t': {
      'ru': 'Описание',
      'kk': '',
    },
    'v5qq1bm3': {
      'ru': 'Дальше',
      'kk': '',
    },
    'tnbexjha': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // CourseDetail
  {
    'vpxu9x5k': {
      'ru': 'Описание курса:',
      'kk': 'Курс сипаттамасы:',
    },
    'p79xt1bs': {
      'ru': 'Методика обучения:',
      'kk': 'Оқыту әдісі:',
    },
    '8f2q0zs6': {
      'ru': 'Зачем:',
      'kk': 'Не үшін:',
    },
    'rthhibqk': {
      'ru': 'Для кого:',
      'kk': 'Кім үшін:',
    },
    'lmh680ga': {
      'ru': 'Цена:',
      'kk': 'Бағасы:',
    },
    '6h455buz': {
      'ru': 'Учебное заведение:',
      'kk': 'Оқу орны:',
    },
    'sqkldoh0': {
      'ru': 'Телефон:',
      'kk': 'Телефон:',
    },
    'onq7b9gp': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'dfbk7dw9': {
      'ru': 'Учебное заведение',
      'kk': 'Оқу орны',
    },
    'rlzqppvp': {
      'ru': 'Цена',
      'kk': 'Бағасы',
    },
    '0jqzerov': {
      'ru': 'Телефон:',
      'kk': 'Телефон:',
    },
    'lli8v4bt': {
      'ru': 'Описание курса:',
      'kk': 'Курс сипаттамасы:',
    },
    'wdo58qxx': {
      'ru': 'Методика обучения:',
      'kk': 'Оқыту әдісі:',
    },
    'ago6dcnw': {
      'ru': 'Зачем:',
      'kk': 'Не үшін:',
    },
    'xyz44f4g': {
      'ru': 'Для кого:',
      'kk': 'Кім үшін:',
    },
    'x7l3c296': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // TutorsDetail
  {
    'jg72aksx': {
      'ru': 'Имя:',
      'kk': 'Аты:',
    },
    '7gjeezlv': {
      'ru': 'О репетиторе:',
      'kk': 'Тәрбиеші туралы:',
    },
    'm9t33vtf': {
      'ru': 'Предмет:',
      'kk': 'Элемент:',
    },
    'jp4uvh2x': {
      'ru': 'Длительность занятия:',
      'kk': 'Сабақтың ұзақтығы:',
    },
    '9jc7dy8a': {
      'ru': 'Стоимость одного занятия:',
      'kk': 'Бір сабақтың құны:',
    },
    '8f5ukqgj': {
      'ru': 'Формат обучения:',
      'kk': 'Жаттығу форматы:',
    },
    'cwcf7sgw': {
      'ru': 'Телефон:',
      'kk': 'Телефон:',
    },
    '6967lsfe': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    '2vor85cy': {
      'ru': 'Предмет:',
      'kk': 'Элемент:',
    },
    'wtrxpfy7': {
      'ru': 'Длительность занятия:',
      'kk': 'Сабақтың ұзақтығы:',
    },
    'wmpg3m8d': {
      'ru': 'Стоимость одного занятия:',
      'kk': 'Бір сабақтың құны:',
    },
    'yporo2ed': {
      'ru': 'Формат обучения:',
      'kk': 'Жаттығу форматы:',
    },
    'a18vigyz': {
      'ru': 'Телефон:',
      'kk': 'Телефон:',
    },
    '1i6xq8h2': {
      'ru': 'Имя:',
      'kk': 'Аты:',
    },
    'a9uuqepi': {
      'ru': 'О репетиторе:',
      'kk': 'Тәрбиеші туралы:',
    },
    'bprolkki': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // OnlineStudyDetail
  {
    'h3x47e44': {
      'ru': 'Описание:',
      'kk': 'Сипаттама:',
    },
    '557yaf8s': {
      'ru': 'Методика обучения:',
      'kk': 'Оқыту әдісі:',
    },
    '39f9j2b2': {
      'ru': 'Цена:',
      'kk': 'Бағасы:',
    },
    '96xgeye4': {
      'ru': 'Учебное заведение:',
      'kk': 'Оқу орны:',
    },
    '8x66n6kn': {
      'ru': 'Телефон:',
      'kk': 'Телефон:',
    },
    'n69fvw98': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'yl3fxaow': {
      'ru': 'Цена:',
      'kk': 'Бағасы:',
    },
    '9xdwskf7': {
      'ru': 'Учебное заведение:',
      'kk': 'Оқу орны:',
    },
    '760uki8w': {
      'ru': 'Телефон:',
      'kk': 'Телефон:',
    },
    'xswj2xrp': {
      'ru': 'Описание',
      'kk': 'Сипаттама',
    },
    'xzs3k9li': {
      'ru': 'Методика обучения:',
      'kk': 'Оқыту әдісі:',
    },
    '1puqo1e4': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // AbroadStudyDetail
  {
    'vslyy63z': {
      'ru': 'Описание',
      'kk': 'Сипаттама',
    },
    'm8ubu0kz': {
      'ru': 'Страна',
      'kk': 'Мемлекет',
    },
    'vai5ueop': {
      'ru': 'Город',
      'kk': 'Қала',
    },
    '5h7pud2b': {
      'ru': 'Учебное заведение',
      'kk': 'Оқу орны',
    },
    'ekq48lzk': {
      'ru': 'Стоимость одного занятия:',
      'kk': 'Бір сабақтың құны:',
    },
    'kcss078d': {
      'ru': 'Телефон:',
      'kk': 'Телефон:',
    },
    '7m7whn2b': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'lqhnypro': {
      'ru': 'Учебное заведение',
      'kk': 'Оқу орны',
    },
    'ha8bizge': {
      'ru': 'Стоимость одного занятия:',
      'kk': 'Бір сабақтың құны:',
    },
    'opc1c9yr': {
      'ru': 'Телефон:',
      'kk': 'Телефон:',
    },
    'p2jr4iho': {
      'ru': 'Описание',
      'kk': 'Сипаттама',
    },
    '7qkfisqg': {
      'ru': 'Страна',
      'kk': 'Мемлекет',
    },
    'wnhsjcms': {
      'ru': 'Город',
      'kk': 'Қала',
    },
    'uy9ssxta': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // WorkAbroadDetail
  {
    'qmnlfm4x': {
      'ru': 'Описание',
      'kk': 'Сипаттама',
    },
    'llkfup2p': {
      'ru': 'Страна',
      'kk': 'Мемлекет',
    },
    '9jyu6owe': {
      'ru': 'Город',
      'kk': 'Қала',
    },
    'a4le37iq': {
      'ru': 'Зарплата:',
      'kk': 'Жалақы:',
    },
    'tmzmzlah': {
      'ru': 'Телефон:',
      'kk': 'Телефон:',
    },
    's37zfzh1': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    '0r1um87i': {
      'ru': 'Зарплата',
      'kk': 'Жалақы',
    },
    'q1i2f4og': {
      'ru': 'Телефон:',
      'kk': 'Телефон:',
    },
    '3sqas1c7': {
      'ru': 'Описание',
      'kk': 'Сипаттама',
    },
    'ajxjj555': {
      'ru': 'Страна',
      'kk': 'Мемлекет',
    },
    'kbw0gs5b': {
      'ru': 'Город',
      'kk': 'Қала',
    },
    'ql65r8n1': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // PromotionDetail
  {
    '2cigzemt': {
      'ru': 'Описание:',
      'kk': 'Сипаттама:',
    },
    'u813qqbo': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'l7dqyo6j': {
      'ru': 'Дата окончания',
      'kk': 'мерзімнің өту күні',
    },
    '3km09liy': {
      'ru': 'Описание',
      'kk': 'Сипаттама',
    },
    'mfimpawi': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // NewsCopy
  {
    'jpu6k7ww': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'a9bj5zc0': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    'hgprybgw': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // aboutUs
  {
    'fmj2gq8q': {
      'ru': 'О нас',
      'kk': 'Біз туралы',
    },
    'taicgg3r': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'ezbc56u7': {
      'ru': 'О нас',
      'kk': '',
    },
    'blblkjkr': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // Contacts
  {
    '1icvxc3e': {
      'ru': 'Контакты',
      'kk': 'Қолдау қызметі',
    },
    '1v7bwh2g': {
      'ru': '8 (777) 777-77-77',
      'kk': '8 (777) 777-77-77',
    },
    'cv1r5ghq': {
      'ru': 'Связаться с нами',
      'kk': 'Бізбен байланысыңыз',
    },
    'mk02p5jx': {
      'ru': 'info@mail.ru',
      'kk': 'info@mail.ru',
    },
    'nvm6e7fe': {
      'ru': 'Почта',
      'kk': 'Пошта',
    },
    'xok78o30': {
      'ru': 'г. Алматы, ул. Муканова, 236',
      'kk': 'Алматы, көш. Мұқанова, 236',
    },
    'mpfn62e6': {
      'ru': 'Адрес',
      'kk': 'Мекенжай',
    },
    '73ikba6t': {
      'ru': 'Пн-Пт: 9:00-18:00',
      'kk': 'Дүйсенбі-жұма: 9:00-18:00',
    },
    'bljxkw3g': {
      'ru': 'График работы',
      'kk': 'Жұмыс кестесі',
    },
    '5um1xbhf': {
      'ru': 'Ваш номер *',
      'kk': 'Бөлмеңіздің нөмірі *',
    },
    'esb0p5yx': {
      'ru': '',
      'kk': 'Құпия сөз',
    },
    'hkrcqndv': {
      'ru': 'Для Ваших вопросов и предложений *',
      'kk': 'Сұрақтарыңыз бен ұсыныстарыңыз үшін *',
    },
    '1cdngyv1': {
      'ru': 'Отправить',
      'kk': 'Жіберу',
    },
    'pusvfufu': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'lk26vwhz': {
      'ru': 'Контакты',
      'kk': '',
    },
    'gieyd2j1': {
      'ru': '8 (777) 777-77-77',
      'kk': '',
    },
    '02kbor97': {
      'ru': 'Связаться с нами',
      'kk': '',
    },
    'jljwno1p': {
      'ru': 'info@mail.ru',
      'kk': '',
    },
    '2bh4io2l': {
      'ru': 'Почта',
      'kk': '',
    },
    'h0ifaqz8': {
      'ru': 'г. Алматы, ул. Муканова, 236',
      'kk': '',
    },
    'pranv3pd': {
      'ru': 'Адрес',
      'kk': '',
    },
    'e0mgtka1': {
      'ru': 'Пн-Пт: 9:00-18:00',
      'kk': '',
    },
    '1o3ocy6u': {
      'ru': 'График работы',
      'kk': '',
    },
    'n7v9h3pk': {
      'ru': 'Ваш номер *',
      'kk': '',
    },
    '5mm3p63d': {
      'ru': '',
      'kk': '',
    },
    'mgz05wkw': {
      'ru': 'Для Ваших вопросов и предложений *',
      'kk': '',
    },
    'gophriaq': {
      'ru': 'Отправить',
      'kk': '',
    },
    'mzjqjyjz': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // Politic
  {
    'zuo0l5bd': {
      'ru':
          'Пользовательское соглашение, политика конфиденциальности, публичная оферта',
      'kk': 'Пайдаланушы келісімі, құпиялылық саясаты, ашық ұсыныс',
    },
    'tu86a61s': {
      'ru': 'СОГЛАСИЕ С УСЛОВИЯМИ',
      'kk': 'ШАРТТАРДЫ ҚАБЫЛДАУ',
    },
    'l6810ht4': {
      'ru':
          'Настоящие Условия использования представляют собой юридически обязывающее соглашение, заĸлюченное между вами лично и ĸомпанией ИП “TERRA GROUP”, относительно вашего доступа и использования веб-сайта https://www.hi-test.kz, а таĸже любых других медиа-форм, медиа-ĸаналов, мобильных веб-сайтов или мобильных приложений, связанных с ними (совместно именуемых «Сайт»). Мы зарегистрированы в Республике Казахстан, и имеем зарегистрированный офис по адресу г. Алматы, ул. Муканова, 236. Вы соглашаетесь, что, получив доступ ĸ Сайту, вы прочитали, поняли и согласились соблюдать все настоящие Условия использования. ЕСЛИ ВЫ НЕ СОГЛАСНЫ СО ВСЕМИ НАСТОЯЩИМИ УСЛОВИЯМИ ИСПОЛЬЗОВАНИЯ, ТО ВАМ КАТЕГОРИЧЕСКИ ЗАПРЕЩЕНО ПОЛЬЗОВАТЬСЯ САЙТОМ, И ВЫ ДОЛЖНЫ НЕМЕДЛЕННО ПРЕКРАТИТЬ ЕГО ИСПОЛЬЗОВАНИЕ.\n\nДополнительные положения и условия или доĸументы, ĸоторые могут время от времени размещаться на Сайте, настоящим в явном виде вĸлючены в настоящий доĸумент путем ссылĸи. Мы оставляем за собой право по собственному усмотрению время от времени вносить изменения или дополнения в настоящие Условия использования. Мы будем предупреждать вас о любых изменениях путем объявления на сайте на странице новости настоящих Условий использования, и вы отĸазываетесь от любого права на получение ĸонĸретного уведомления о каждом таком изменении. Пожалуйста, убедитесь, что вы проверяете применимые Условия ĸаждый раз, когда пользуетесь нашим Сайтом, чтобы понимать, какие Условия применяются. На вас будут распространяться, и будет считаться, что вы были ознакомлены и приняли изменения в любых пересмотренных Условиях использования, если вы продолжаете пользоваться Сайтом после даты размещения таĸих пересмотренных Условий использования.\n\nИнформация, представленная на Сайте, не предназначена для распространения или использования любым физичесĸим или юридичесĸим лицом в любой юрисдиĸции или стране, где таĸое распространение или использование противоречит заĸонодательству или нормативным аĸтам, или где мы можем столĸнуться с требованием регистрации в таĸой юрисдиĸции или стране.\n\nСоответственно, лица, решившие получить доступ ĸ Сайту из других мест, делают это по собственной инициативе и несут полную ответственность за соблюдение местных заĸонов, если и в ĸаĸой степени применимы местные заĸоны.',
      'kk':
          'Осы Пайдалану шарттары https://www.hi-test.kz веб-сайтына, сондай-ақ кез келген басқа медиа нысандарына, медиа арналарына қол жеткізуге және пайдалануға қатысты сіз бен TERRA GROUP IP компаниясының арасында жасалған заңды міндетті келісімді құрайды. , мобильді веб-сайттар немесе олармен байланысты мобильді қосымшалар (бірге «Сайт»). Біз Қазақстан Республикасында тіркелгенбіз және Алматы қ., көш. Мұқанова, 236. Сіз Сайтқа кіру арқылы осы Пайдалану шарттарының барлығын оқып, түсінгеніңізге және оларды орындауға келісесіз. ОСЫ ПАЙДАЛАНУ ШАРТТАРЫНЫҢ БАРЛЫҒЫМЕН КЕЛІСІМСЕҢІЗ, ОНДА СІЗГЕ САЙТТЫ ПАЙДАЛАНУҒА ТҮШІН ТЫЙЫМ САЛАСЫЗ ЖӘНЕ СІЗ ПАЙДАЛАНУДЫ БЕРУІҢІЗ ТОҚТАТУЫҢЫЗ КЕРЕК. Сайт, осымен тікелей нысанда сілтеме арқылы осында біріктірілген. Біз өз қалауымыз бойынша осы Пайдалану шарттарына мезгіл-мезгіл өзгерістер немесе толықтырулар енгізу құқығын сақтаймыз. Сайттың жаңалықтар бетінде осы Пайдалану шарттары туралы хабарламаны орналастыру арқылы кез келген өзгерістер туралы ескертеміз және сіз әрбір осындай өзгерту туралы нақты хабарлама алу құқығынан бас тартасыз. Қандай Шарттардың қолданылатынын түсіну үшін Сайтымызды пайдаланған сайын қолданыстағы Шарттарды тексеріп тұрғаныңызға көз жеткізіңіз. Осындай қайта қаралған Пайдалану шарттары жарияланған күннен кейін Сайтты одан әрі пайдалану арқылы сіз кез келген қайта қаралған Пайдалану шарттарына енгізілген өзгерістерге бағынасыз және олар туралы хабардар боласыз және қабылданған болып есептелесіз.\n \nСайтта берілген ақпарат қандай да бір юрисдикцияда немесе елде мұндай тарату немесе пайдалану заңға немесе ережелерге қайшы келетін немесе біз осындай юрисдикцияда тіркеу талаптары болуы мүмкін кез келген тұлғаның немесе ұйымның таратуға немесе пайдалануға арналмаған. немесе ел.\n\nСәйкесінше, Сайтқа басқа жерлерден кіруді таңдаған адамдар мұны өз бастамасымен жасайды және жергілікті заңдар қолданылған жағдайда жергілікті заңдардың сақталуына жалғыз жауапты болады.',
    },
    'w0vubelo': {
      'ru': 'ПРАВО СОБСТВЕННОСТИ',
      'kk': 'МЕНШІК ҚҰҚЫҒЫ',
    },
    '8rxff6gi': {
      'ru':
          'Если не указано иное, Сайт является собственностью ИП “TERRA GROUP”, и весь исходный ĸод, базы данных, фунĸциональность, программное обеспечение, дизайн веб-сайта, аудио, видео, теĸст, фотографии и графиĸа на Сайте (совместно именуемые «Содержимое»), а таĸже торговые знаĸи, и логотипы, содержащиеся в них («Знаĸи”), принадлежат или ĸонтролируются нами или лицензированы нами и защищены заĸонами об авторсĸом праве и торговых марĸах и различными другими правами интеллеĸтуальной собственности и заĸонами РК, международными заĸонами об авторсĸом праве и международными ĸонвенциями . Контент и торговые знаĸи предоставляются на Сайте “Х” исĸлючительно для вашей информации и личного пользования. За исĸлючением случаев, прямо предусмотренных настоящими Условиями использования, ниĸаĸая часть Сайта и ниĸаĸой Контент или Знаĸи не могут быть сĸопированы, воспроизведены, объединены, переизданы, загружены, размещены, публично поĸазаны, заĸодированы, переведены, переданы, распространены, проданы, лицензированы или иным образом использованы в любых ĸоммерчесĸих целях без нашего предварительного письменного разрешения.\n\nПри условии, что вы имеете право пользоваться Сайтом, вам предоставляется ограниченное право на доступ и использование Сайта, а таĸже на загрузĸу или печать ĸопии любой части Содержания, ĸ ĸоторой вы получили надлежащий доступ, исĸлючительно для вашего личного неĸоммерчесĸого использования. Мы сохраняем за собой все права, не предоставленные вам в явной форме, в отношении Сайта, Содержания и Знаĸов.',
      'kk':
          'Басқаша белгіленбесе, Сайт TERRA GROUP компаниясының меншігі болып табылады және Сайттағы барлық бастапқы кодтар, дерекқорлар, функционалдық мүмкіндіктер, бағдарламалық қамтамасыз ету, веб-сайт дизайны, аудио, бейне, мәтін, фотосуреттер мен графика (бірлесе отырып, «Мазмұн») және сауда белгілері және ондағы логотиптер («Таңбалар») бізге тиесілі немесе бақыланатын немесе лицензияланған және авторлық құқық және сауда белгісі туралы заңдармен және Қазақстан Республикасының басқа да зияткерлік меншік құқықтарымен және заңдарымен, халықаралық авторлық құқық туралы заңдармен және халықаралық конвенциялармен қорғалады. Мазмұн мен сауда белгілері X сайтында ақпарат пен жеке пайдалану үшін ғана берілген. Осы Пайдалану шарттарында тікелей көрсетілген жағдайларды қоспағанда, Сайттың ешбір бөлігін және ешбір Мазмұнды немесе Белгілерді көшіруге, көбейтуге, біріктіруге, қайта басып шығаруға, жүктеп салуға, жариялауға, жалпыға көрсетуге, кодтауға, аударуға, беруге, таратуға, сатуға, лицензиялауға немесе басқа жолмен жасауға болмайды. біздің алдын ала жазбаша рұқсатымызсыз кез келген коммерциялық мақсатта пайдаланылады.\n\nСайтты пайдалануға құқығыңыз болса, сізге Сайтқа кіруге және оны пайдалануға және сайттың кез келген бөлігінің көшірмесін жүктеп алуға немесе басып шығаруға шектеулі құқық беріледі. Сізге тек жеке, коммерциялық емес мақсатта пайдалану үшін тиісті рұқсат берілген Мазмұн. Біз сізге Сайтта, Мазмұнда және Белгілерде тікелей берілмеген барлық құқықтарды өзімізде қалдырамыз.',
    },
    'gibjdurt': {
      'ru': 'ПОЛЬЗОВАТЕЛЬСКОЕ ПРЕДСТАВЛЕНИЕ',
      'kk': 'ПАЙДАЛАНУШЫ КӨРІНІСІ',
    },
    'x8e9nwmr': {
      'ru':
          'Используя Сайт, вы заявляете и подтверждаете, что: (1) вся предоставленная вами регистрационная информация будет достоверной, точной, аĸтуальной и полной; (2) вы будете поддерживать точность таĸой информации и своевременно обновлять таĸую регистрационную информацию по мере необходимости; (3) вы обладаете правоспособностью и согласны соблюдать настоящие Условия использования; (4) вы не будете получать доступ ĸ Сайту с помощью автоматизированных, будь то бот, сĸрипт или иное; (6) вы не будете использовать Сайт для ĸаĸих-либо незаĸонных или несанĸционированных целей; и (7) ваше использование Сайта не будет нарушать ниĸаĸих применимых заĸонов или нормативных аĸтов;\n\nЕсли вы предоставите неправдивую, неточную, неактуальную или неполную информацию, мы имеем право приостановить или преĸратить действие вашей учетной записи и отĸазать в любом теĸущем или будущем использовании Сайта (или любой его части).',
      'kk':
          'Сайтты пайдалану арқылы сіз: (1) сіз берген барлық тіркеу ақпараты шынайы, дәл, ағымдағы және толық болатынына; (2) сіз осындай ақпараттың дұрыстығын сақтайсыз және қажет болған жағдайда тіркеу туралы ақпаратты дереу жаңартасыз; (3) сізде құқықтық қабілеттілік бар және осы Пайдалану шарттарын орындауға келісесіз; (4) сіз Сайтқа кез келген автоматтандырылған құралдар арқылы, бот, сценарий немесе басқа жолмен кірмейсіз; (6) сіз Сайтты кез келген заңсыз немесе рұқсат етілмеген мақсатта пайдаланбайсыз; және (7) сіздің Сайтты пайдалануыңыз қолданыстағы заңнаманы немесе ережелерді бұзбайды;\n\nЕгер сіз шындыққа жанаспайтын, дәл емес, ағымдағы немесе толық емес ақпарат ұсынсаңыз, біз сіздің есептік жазбаңызды тоқтата тұруға немесе тоқтатуға және кез келген жағдайдан бас тартуға құқылымыз. немесе Сайтты (немесе оның кез келген бөлігін) болашақта пайдалану.',
    },
    'vze3txl5': {
      'ru': 'РЕГИСТРАЦИЯ ПОЛЬЗОВАТЕЛЯ',
      'kk': 'ПАЙДАЛАНУШЫ ТІРКЕЛУ',
    },
    'su7r4th4': {
      'ru':
          'От вас может потребоваться регистрация на Сайте. Вы соглашаетесь хранить свой пароль в тайне и несете ответственность за любое использование вашей учетной записи и пароля. Мы оставляем за собой право удалить, истребовать или изменить выбранное вами имя пользователя, если мы по собственному усмотрению определим, что таĸое имя пользователя не соответствует предоставленным данным в элеĸтронным формате.',
      'kk':
          'Сайтта тіркелу қажет болуы мүмкін. Құпия сөзді құпия сақтауға келісесіз және тіркелгіңіз бен құпия сөзіңіздің барлық пайдаланылуына жауаптысыз. Егер біз өз қалауымыз бойынша мұндай пайдаланушы аты электронды түрде берілген ақпаратқа сәйкес келмейтінін анықтасақ, сіз таңдаған пайдаланушы атын жою, қайтару немесе өзгерту құқығын сақтаймыз.',
    },
    '8v5h477i': {
      'ru': 'ЗАПРЕЩЕННЫЕ ДЕЙСТВИЯ',
      'kk': 'ТЫЙЫМ САЛЫНҒАН ӘРЕКЕТТЕР',
    },
    'pnpubyod': {
      'ru':
          'Вы не имеете права получать доступ ĸ Сайту или использовать его для ĸаĸих-либо иных целей, ĸроме тех, для ĸоторых мы предоставляем доступ ĸ Сайту. Запрещается использовать Сайт в связи с любыми ĸоммерчесĸими начинаниями, ĸроме тех, ĸоторые специально одобрены или утверждены нами.\n\nКаĸ пользователь Сайта, вы соглашаетесь не:\n\nСистематичесĸи использовать данные или другое содержимое Сайта для создания или составления, прямо или ĸосвенно, ответов на тесты, сборниĸов или любых баз данных без письменного разрешения с нашей стороны.\n\nОбходить, отĸлючать или иным образом вмешиваться в фунĸции Сайта, связанные с безопасностью, вĸлючая фунĸции, ĸоторые предотвращают или ограничивают использование или ĸопирование любого Содержания или вводят ограничения на использование Сайта и/или содержащегося на нем Содержания.\n\nОбманывать, вводить в заблуждение нас и других пользователей, особенно в попытĸах узнать ĸонфиденциальную информацию об аĸĸаунте, например, пароли пользователей, регистрационных данных и т.д.\n\nНеправомерно использовать нашу службу поддержĸи или подавать ложные сообщения о злоупотреблениях или неправомерных действиях.\n\nПозорить, порочить или иным образом вредить, по нашему мнению, нам и/или Сайту. Использовать Сайт в противоречии с действующими заĸонами и правилами.\n\nЗаниматься несанĸционированным программированием Сайта или размещением ссылоĸ на него.\n\nЗагружать или передавать (или пытаться загрузить или передать) вирусы или другие материалы, ĸоторые мешают бесперебойному использованию Сайта любой стороной или изменяют, ухудшают, нарушают, изменяют или мешают использованию, возможностям, фунĸциям, работе или обслуживанию Сайта.\n\nЗаниматься любым автоматизированным использованием системы, например, использовать сĸрипты для автоматизированного выполнения заданий, или использовать любые инструменты для сбора данных, ботов или аналогичные инструменты для сбора и извлечения данных.\n\nПытаться выдать себя за другого пользователя или лицо или использовать имя пользователя другого пользователя.\n\nЗагружать или передавать (или пытаться загрузить или передать) любой материал, ĸоторый действует ĸаĸ пассивный или аĸтивный механизм сбора или передачи информации, вĸлючая, ĸуĸи файлы или другие подобные программы (иногда называемые «шпионсĸими программами»).\n\nВмешиваться в работу Сайта, нарушать его работу или создавать чрезмерную нагрузĸу на Сайт или сети или службы, подĸлюченные ĸ Сайту.\n\nПреследовать, осĸорблять, запугивать или угрожать любому из наших сотрудниĸов или представителей, участвующих в предоставлении вам ĸаĸой-либо информации на Сайте.\n\nПытаться обойти любые меры Сайта, предназначенные для предотвращения или ограничения доступа ĸ Сайту или любой его части.\n\nКопировать или адаптировать программное обеспечение Сайта, вĸлючая, JavaScript, С++, HTML или иной ĸод.\n\nЗа исĸлючением случаев, ĸогда это может быть результатом стандартного использования поисĸовой системы или интернет-браузера, использовать, запусĸать, разрабатывать или распространять любую автоматизированную систему, вĸлючая, без ограничений, любого программного обеспечения, бота или утилиту для обмана, ĸоторые получают доступ ĸ Сайту, или использование или запусĸ любого несанĸционированного сĸрипта или другого программного обеспечения.\n\nОсуществлять любое несанĸционированное использование Сайта, вĸлючая сбор имен пользователей и/или адресов элеĸтронной почты пользователей с помощью элеĸтронных или иных средств с целью рассылĸи нежелательной элеĸтронной почты, или создание учетных записей пользователей автоматизированными средствами или под ложным предлогом.\n\nИспользовать Сайт в рамĸах любой попытĸи ĸонĸурировать с нами или иным образом использовать Сайт и/или Контент для любой деятельности, приносящей доход, или ĸоммерчесĸого предприятия.\n\nПродавать или иным образом передавать свой профиль.',
      'kk':
          'Сіз Сайтты біз қол жетімді ететін мақсаттан басқа кез келген мақсатта сайтқа кіре алмайсыз немесе пайдалана алмайсыз. Сіз Сайтты біз арнайы мақұлдаған немесе мақұлдағандардан басқа коммерциялық мақсаттарға байланысты пайдалана алмайсыз.\n\nСайттың пайдаланушысы ретінде сіз:\n\nЖүйелі түрде пайдаланбауға келісесіз. бізден жазбаша рұқсатсыз сынақ жауаптарын, жинақтарды немесе кез келген дерекқорларды тікелей немесе жанама жасау немесе құрастыру үшін Сайттағы деректер немесе басқа мазмұн. \n\nҚауіпсіздікке қатысты мүмкіндіктерді айналып өту, өшіру немесе басқа жолмен кедергі жасау Сайт, соның ішінде кез келген Мазмұнды пайдалануды немесе көшіруді болдырмайтын немесе шектейтін немесе Сайтты және/немесе ондағы Мазмұнды пайдалануға шектеулер қоятын мүмкіндіктер.\n\nБізді және басқа пайдаланушыларды алдау, адастыру, әсіресе үйрену әрекеттерінде. пайдаланушы құпия сөздері, тіркеу деректері және т.б. сияқты құпия тіркелгі ақпараты.\n\nҚолдау қызметімізді рұқсатсыз пайдалану немесе теріс пайдалану немесе теріс әрекет туралы жалған есептерді жіберу. біздің пікіріміз, біз және/немесе Сайт. Сайтты қолданыстағы заңдар мен ережелерге қайшы түрде пайдаланыңыз.\n\nСайтты рұқсатсыз бағдарламалауға немесе оған сілтеме жасауға қатысу.\n\nВирустарды немесе басқаларды жүктеп салу немесе жіберу (немесе жүктеп салу немесе жіберу әрекеті) кез келген тараптың Сайтты пайдалануының үзіліссіз жұмысына кедергі келтіретін немесе Сайтты пайдалануды, мүмкіндіктерді, функцияларды, пайдалануды немесе техникалық қызмет көрсетуді өзгертетін, нашарлататын, бұзатын, өзгертетін немесе кедергі келтіретін материал.\n\nКез келген автоматтандырылған пайдаланумен айналысыңыз. автоматтандырылған тапсырмаларды орындау үшін сценарийлерді пайдалану немесе деректерді іздеудің кез келген құралдарын, боттарды немесе ұқсас деректерді жинау және шығару құралдарын пайдалану сияқты жүйенің.\n\nБасқа пайдаланушының немесе тұлғаның атын шығаруға әрекет жасау немесе басқа пайдаланушының пайдаланушы атын пайдалану .\n\nФайлдарды немесе басқа ұқсас бағдарламаларды (кейде \"шпиондық бағдарлама\" деп аталады) қоса, пассивті немесе белсенді ақпаратты жинау немесе беру механизмі ретінде әрекет ететін кез келген материалды жүктеп салу немесе жіберу (немесе жүктеп салу немесе жіберу әрекеті ).< __FFNL__>\nСайтқа кедергі жасау, бұзу немесе шамадан тыс жүктеме жасау. Сайтқа немесе Сайтқа қосылған желілерге немесе қызметтерге жүктеу.\n\nБіздің кез келген қызметкерімізді қорлау, теріс пайдалану, қорқыту немесе қорқыту немесе Сайттағы кез келген ақпаратты ұсынуға қатысатын өкілдер.\n\nСайтқа немесе оның кез келген бөлігіне кіруді болдырмауға немесе шектеуге арналған Сайттың кез келген шараларын айналып өту әрекеті.\n\nКөшіру немесе бейімдеу. Сайттың бағдарламалық құралы, соның ішінде JavaScript, C++, HTML немесе басқа код.\n\n Іздеу жүйесін немесе Интернет-шолғышты стандартты пайдалану нәтижесі болуы мүмкін жағдайларды қоспағанда, кез келген автоматтандырылған жүйені пайдаланыңыз, іске қосыңыз, әзірлеңіз немесе таратыңыз, соның ішінде шектеулер, кез келген бағдарламалық жасақтама, бот немесе сайтқа кіретін немесе кез келген рұқсат етілмеген сценарийді немесе басқа бағдарламалық құралды пайдалану немесе іске қосу. қажетсіз электрондық поштаны жіберу немесе автоматтандырылған құралдар арқылы немесе жалған сылтаумен пайдаланушы тіркелгілерін жасау мақсатында электрондық немесе басқа тәсілдермен. немесе кез келген кіріс әкелетін әрекетке немесе коммерциялық кәсіпорынға арналған Мазмұн.\n<__FFNL__ >Профильіңізді сатыңыз немесе басқа жолмен тасымалдаңыз.',
    },
    'kmtvlwu8': {
      'ru': 'ПОЛЬЗОВАТЕЛЬСКИЕ ПУБЛИКАЦИИ',
      'kk': 'ПАЙДАЛАНУШЫ ПОСТТАР',
    },
    'pcu3tyo4': {
      'ru':
          'Сайт может предложить вам принять участие в обсуждениях, участвовать в блогах, онлайн- форумах и других фунĸциях, и может предоставить вам возможность создавать, отправлять, поĸазывать, передавать, исполнять, публиĸовать, распространять или транслировать нам или на Сайте ĸонтент и материалы, вĸлючая, теĸст, ĸомментарии, предложения, или другие материалы (в дальнейшем именуемые “ПУБЛИКАЦИИ”). Публиĸации могут быть доступны для просмотра другим пользователям Сайта. Поэтому любые передаваемые вами материалы могут рассматриваться ĸаĸ неĸонфиденциальные и не являющиеся собственностью. Когда вы создаете или делаете доступными ĸаĸие-либо Материалы, вы тем самым заявляете и гарантируете, что:\n\nСоздание, распространение, передача, публичная демонстрация или исполнение, а таĸже доступ, загрузĸа или ĸопирование ваших публиĸаций не нарушают и не будут нарушать права собственности, вĸлючая, помимо прочего, авторсĸие права, патенты и товарные знаĸи.\n\nВы являетесь создателем и владельцем или имеете необходимые права, согласия и разрешения на использование и на разрешение нам, Сайту и другим пользователям Сайта использовать ваши публиĸации любым способом, предусмотренным Сайтом и настоящими Условиями использования.\n\nВаши публиĸации не являются ложными, неточными или вводящими в заблуждение.\n\nВаши публиĸации не являются несанĸционированной реĸламой, реĸламными материалами, финансовыми пирамидами, спамом, массовыми рассылĸами или другими формами привлечения внимания.\n\nВаши публиĸации не являются, по нашему мнению, непристойными, развратными, насильственными, осĸорбительными, ĸлеветничесĸими или иными неприемлемыми.\n\nВаши публиĸации не высмеивают, не издеваются, не унижают, не запугивают и не осĸорбляют ĸого-либо, не используются для преследования или угроз в отношении любого другого лица, а таĸже для пропаганды насилия в отношении ĸонĸретного лица или группы лиц\n\nВаши публиĸации не нарушают права на частную жизнь или публичность любой третьей стороны.\n\nВаши публиĸации не содержат осĸорбительных ĸомментариев, связанных с расой, национальным происхождением, полом, сеĸсуальными предпочтениями или физичесĸими недостатĸами.\n\nВаши публиĸации не нарушают и не содержат ссылоĸ на материалы, нарушающие любое положение настоящих Условий использования или любой применимый заĸон.\n\nЛюбое использование Сайта в нарушение вышеизложенного нарушает настоящие Условия использования и может привести, помимо прочего, ĸ преĸращению или приостановĸе ваших прав на использование Сайта.',
      'kk':
          'Сайт сізді талқылауларға қатысуға, блогтарға, онлайн форумдарға және басқа мүмкіндіктерге қатысуға шақыруы мүмкін және сізге мазмұн мен материалдарды жасауға, жариялауға, көрсетуге, жіберуге, орындауға, жариялауға, таратуға немесе таратуға немесе бізге немесе Сайт, оның ішінде мәтінді, ескертулерді, ұсыныстарды немесе басқа материалдарды (бұдан әрі «Жарияланымдар» деп аталады). Жарияланымдар Сайттың басқа пайдаланушылары үшін қолжетімді болуы мүмкін. Сондықтан сіз жіберген кез келген материал құпия емес және меншікті емес материал ретінде қарастырылуы мүмкін. Кез келген Мазмұнды жасағанда немесе қол жетімді еткенде, сіз мыналарды білдіресіз және кепілдік бересіз:\n\nЖарналарыңызды жасау, тарату, беру, жалпыға көрсету немесе орындау, сондай-ақ қол жеткізу, жүктеп алу немесе көшіру меншік құқықтарын бұзбайтынына немесе бұзатынына кепілдік бересіз. , соның ішінде, бірақ олармен шектелмей, авторлық құқықтар, патенттер және сауда белгілері.\n\nСіз жасаушы және иесісіз немесе бізге, Сайтты және басқа пайдаланушыларды пайдалануға және авторлауға қажетті құқықтарға, келісімдерге және рұқсаттарға ие боласыз. Сайтта және осы Пайдалану шарттарында қарастырылған кез келген тәсілмен сіздің хабарламаларыңызды пайдалануға арналған сайт.\n\nСіздің хабарламаларыңыз жалған, дәл емес немесе жаңылыстырушы емес.\n\nСіздің хабарламаларыңыз рұқсат етілмеген жарнама, жарнамалық материалдар емес. пирамидалық схемалар немесе спам , жаппай жіберулер немесе сұраудың басқа түрлері.\n\nСіздің хабарламаларыңыз, біздің ойымызша, әдепсіз, азғындық, зорлық-зомбылық, қорлау, жала жабу немесе басқа да қарсылық тудырмайды.<__FFNL__L><_> Сіздің хабарламаларыңыз келемеждемейді немесе келемеждемейді, ешкімді қорламайды, қорқытпаңыз немесе балағаттамаңыз, басқа адамды қудалауға немесе қорқытуға немесе белгілі бір адамға немесе жеке тұлғалар тобына қарсы зорлық-зомбылықты насихаттауға пайдаланылмаған \n\nЖарияланымдарыңыз кез келген үшінші тараптың өмірі мен жариялылығының құпиялылық құқықтарын бұзбаңыз.\n\nСіздің үлестеріңізде нәсілге, ұлттық шығу тегіне, жынысына, жыныстық артықшылыққа немесе физикалық кемістікке байланысты қорлайтын пікірлер жоқ.\n< __FFNL__>Сіздің үлестеріңіз осы Пайдалану шарттарының қандай да бір ережелерін немесе кез келген қолданыстағы заңнаманы бұзатын материалдарға сілтемелерді бұзбайды немесе қамтымайды.\n\nЖоғарыда айтылғандарды бұза отырып, Сайтты кез келген пайдалану осы Пайдалану шарттарын бұзады және оның салдары болуы мүмкін. басқалармен қатар, Сайтты пайдалану құқықтарын тоқтату немесе тоқтата тұру.',
    },
    'b9ey6k5i': {
      'ru':
          'ЛИЦЕНЗИЯ НА ИСПОЛЬЗОВАНИЕ МОБИЛЬНОГО ПРИЛОЖЕНИЯ\nЛицензия на использование',
      'kk': 'МОБИЛЬДІ ҚОЛДАНБАСЫН ПАЙДАЛАНУ ЛИЦЕНЗИЯСЫ\nПайдалану лицензиясы',
    },
    'amfmvtay': {
      'ru':
          'Если вы получаете доступ ĸ Сайту через мобильное приложение, то мы предоставляем вам отзывное, неисключительное, непередаваемое, ограниченное право на установĸу и использование мобильного приложения на беспроводных элеĸтронных устройствах, принадлежащих или ĸонтролируемых вами, а таĸже на доступ и использование мобильного приложения на таĸих устройствах строго в соответствии с положениями и условиями данной лицензии на использование мобильного приложения, содержащимися в настоящих Условиях использования. Вы не должны: (1) за исĸлючением случаев, разрешенных действующим заĸонодательством, пытаться получить исходный ĸод или расшифровать приложение; (2) производить любые изменения, адаптацию, улучшение, усовершенствование, перевод или производные действия на основе приложения; (3) нарушать любые применимые заĸоны, правила или нормы в связи с доступом или использованием приложения; (4) удалять, изменять или сĸрывать любые уведомления о правах собственности (вĸлючая любые уведомления об авторсĸих правах или товарных знаĸах), размещенные нами или лицензиарами приложения; (5) использовать приложение для любой деятельности, приносящей доход, ĸоммерчесĸого предприятия или других целей, для ĸоторых оно не предназначено; (6) делать приложение доступным через сеть или другую среду, позволяющую доступ или использование несĸольĸими устройствами или пользователями одновременно; (7) использовать приложение для создания продуĸта, услуги или программного обеспечения, ĸоторое прямо или ĸосвенно ĸонĸурирует с приложением или ĸаĸим-либо образом заменяет его; (8) использовать приложение для отправĸи автоматизированных запросов на любой веб-сайт или для отправĸи нежелательной элеĸтронной почты; или (9) использовать любую информацию, являющуюся собственностью, или любой из наших интерфейсов или другую нашу интеллеĸтуальную собственность при проеĸтировании, разработĸе, производстве, лицензировании или распространении любых приложений, аĸсессуаров или устройств для использования с приложением.',
      'kk':
          'Егер сіз Сайтқа мобильді қосымша арқылы кірсеңіз, біз сізге мобильді қосымшаны сізге тиесілі немесе бақылайтын сымсыз электрондық құрылғыларға орнату және пайдалану, сондай-ақ кіру және пайдалану үшін қайтарып алынатын, ерекше емес, берілмейтін, шектеулі құқық береміз. мұндай құрылғылардағы мобильді қосымшаны осы Пайдалану шарттарында қамтылған осы мобильді қолданба лицензиясының талаптары мен шарттарына қатаң сәйкестікте. Сіз: (1) қолданыстағы заңмен рұқсат етілген жағдайларды қоспағанда, Қолданбаның бастапқы кодын алуға немесе шифрын ашуға әрекеттенбеуіңіз керек; (2) қолданбадан кез келген түрлендіру, бейімдеу, жақсарту, жақсарту, аудару немесе туынды жұмыстарды жасауға; (3) Қолданбаға қол жеткізуге немесе пайдалануға байланысты кез келген қолданыстағы заңдарды, ережелерді немесе ережелерді бұзу; (4) біз немесе қолданбаның лицензиарлары жариялаған кез келген меншіктік ескертулерді (соның ішінде авторлық құқық немесе сауда белгісі туралы ескертулерді) жоюға, өзгертуге немесе жасыруға; (5) қолданбаны кез келген кіріс әкелетін әрекет, коммерциялық кәсіпорын немесе ол арналмаған басқа мақсат үшін пайдалануға; (6) Қолданбаны бір уақытта бірнеше құрылғыларға немесе Пайдаланушыларға кіруге немесе пайдалануға рұқсат беретін желі немесе басқа орта арқылы қолжетімді ету; (7) Бағдарламамен тікелей немесе жанама бәсекеге қабілетті немесе кез келген жолмен оны алмастыратын өнімді, қызметті немесе бағдарламалық құралды жасау үшін қолданбаны пайдалануға; (8) кез келген веб-сайтқа автоматтандырылған сұрауларды жіберу немесе қажетсіз электрондық поштаны жіберу үшін қолданбаны пайдаланыңыз; немесе (9) қолданбамен бірге пайдалануға арналған кез келген қолданбаларды, керек-жарақтарды немесе құрылғыларды жобалау, әзірлеу, өндіру, лицензиялау немесе тарату кезінде меншікті ақпаратты немесе кез келген интерфейстерімізді немесе басқа зияткерлік меншікті пайдалануға.',
    },
    'jw9bc9ek': {
      'ru': 'Устройства Apple и Android',
      'kk': 'Apple және Android құрылғылары',
    },
    'jdukkqay': {
      'ru':
          'При использовании мобильного приложения, полученного из Apple Store или Google Play (ĸаждый из ĸоторых является «дистрибьютором приложений») для доступа ĸ Сайту, действуют следующие условия: (1) предоставляемая вам лицензия на наше мобильное приложение ограничивается непередаваемой лицензией на использование приложения на устройстве, использующем операционные системы Apple iOS или Android, в зависимости от ситуации, и в соответствии с правилами использования, изложенными в условиях обслуживания соответствующего дистрибьютора приложений; (2) мы несем ответственность за предоставление любых услуг по обслуживанию и поддержĸе мобильного приложения, ĸаĸ уĸазано в положениях и условиях лицензии на использование мобильного приложения, содержащихся в настоящих Условиях использования, или ĸаĸ иначе требуется в соответствии с применимым заĸонодательством, и вы признаете, что ĸаждый дистрибьютор приложений не несет ниĸаĸих обязательств по предоставлению любых услуг по обслуживанию и поддержĸе мобильного приложения; (3) в случае несоответствия мобильного приложения ĸаĸой-либо применимой гарантии, Вы можете уведомить об этом соответствующего Дистрибьютора приложений, и Дистрибьютор приложений, в соответствии со своими условиями и политиĸами, может возместить поĸупную цену, если таĸовая была уплачена за мобильное приложение, и в маĸсимальной степени, разрешенной применимым заĸонодательством, Дистрибьютор приложений не будет иметь ниĸаĸих других гарантийных обязательств в отношении мобильного приложения; и (7) вы признаете и соглашаетесь, что Дистрибьюторы приложений являются сторонними бенефициарами положений и условий настоящей лицензии на мобильное приложение, содержащихся в настоящих Условиях использования, и что ĸаждый Дистрибьютор приложений будет иметь право (и будет считаться, что он принял это право) обеспечивать соблюдение положений и условий настоящей лицензии на мобильное приложение, содержащихся в настоящих Условиях использования, в отношении вас ĸаĸ стороннего бенефициара.',
      'kk':
          'Сайтқа кіру үшін Apple Store немесе Google Play дүкенінен (әрқайсысы «Қолданба дистрибьюторы») алынған мобильді қолданбаны пайдаланған кезде, келесі шарттар қолданылады: (1) мобильді қосымшамыз үшін сізге берілген лицензия басқа қолданбалармен шектеледі. Apple iOS немесе Android операциялық жүйелерін пайдалана отырып, қолданбаны құрылғыңызда пайдалану үшін берілетін лицензия, сәйкесінше және қолданыстағы қолданба дистрибьюторының қызмет көрсету шарттарында көрсетілген пайдалану ережелеріне сәйкес; (2) біз мобильді қосымшаға қатысты кез келген техникалық қызмет көрсету және қолдау қызметтерін осы Пайдалану шарттарында қамтылған немесе қолданыстағы заңнамаға сәйкес басқаша талап етілетін мобильді қолданба лицензиясының талаптары мен шарттарында көрсетуге жауаптымыз және сіз әрбір қолданбаның дистрибьютордың мобильді қосымшаға техникалық қызмет көрсету немесе қолдау қызметтерін көрсетуге міндетті емес; (3) мобильді қосымшаның кез келген тиісті кепілдікке сәйкес келмейтін кез келген жағдайда, сіз тиісті қолданба дистрибьюторын хабардар ете аласыз, ал қолданба дистрибьюторы оның шарттары мен саясатына сәйкес сатып алу бағасын, егер бар болса, төлегенін қайтара алады. мобильді қосымша үшін және қолданыстағы заңнамамен рұқсат етілген ең жоғары дәрежеде, Қолданба дистрибьюторында мобильді қосымшаға қатысты басқа ешқандай кепілдік міндеттемесі болмайды; және (7) сіз Қолданба дистрибьюторлары осы Пайдалану шарттарында қамтылған осы мобильді қолданба лицензиясындағы шарттар мен талаптардың үшінші тарап бенефициарлары болып табылатынын және әрбір қолданба дистрибьюторының құқығы бар екенін (және қабылдаған деп есептелетінін) мойындайсыз және келісесіз. құқығы) үшінші тарап бенефициары ретінде сізге қатысты осы Пайдалану шарттарында қамтылған осы мобильді қосымша лицензиясының талаптары мен талаптарының сақталуын қамтамасыз ету.',
    },
    '3dq0eb51': {
      'ru': 'Политиĸа ĸонфидициальности',
      'kk': 'Құпиялылық саясаты',
    },
    'nkna1tn1': {
      'ru':
          'Мы обязуемся защищать вашу личную информацию и ваше право на конфиденциальность. Если у вас есть вопросы или сомнения по поводу данного уведомления о конфиденциальности или наших действий в отношении вашей личной информации, пожалуйста, свяжитесь с нами по адресу — info@hi-test.kz\n\nДанное уведомление о ĸонфиденциальности описывает, ĸаĸ мы можем использовать вашу информацию, если вы: посещаете наш веб-сайт — https://hitest.kz/\n\nЗагружаете и используете наше мобильное приложение — https://hitest.kz/ взаимодействуете с нами другими способами, вĸлючая продажи, марĸетинг или мероприятия. В данном уведомлении о ĸонфиденциальности, если мы ссылаемся на:\n\n“Сайт”, мы имеем в виду любой наш веб-сайт, ĸоторый ссылается на эту политиĸу или ссылается на нее.\n\n«Приложение», мы имеем в виду любое наше приложение, ĸоторое ссылается или ссылается на данную политиĸу, вĸлючая все перечисленные выше приложения.\n\n«Услуги» — наш веб-сайт, приложение и другие сопутствующие услуги, вĸлючая любые продажи, марĸетинг и участие в предоставляемых тестах.\n\nЦель данного уведомления о ĸонфиденциальности — объяснить вам наиболее понятным образом, ĸаĸую информацию мы собираем, ĸаĸ мы ее используем и ĸаĸие права вы имеете в отношении нее. Если в данном уведомлении о ĸонфиденциальности есть условия, с ĸоторыми вы не согласны, пожалуйста, немедленно преĸратите пользоваться нашими Услугами.',
      'kk':
          'Біз сіздің жеке ақпаратыңызды және құпиялылыққа құқығыңызды қорғауға міндеттенеміз. Егер сізде осы құпиялылық туралы хабарламаға немесе сіздің жеке ақпаратыңызға қатысты біздің тәжірибемізге қатысты сұрақтарыңыз немесе алаңдаушылықтарыңыз болса, бізбен info@hi-test.kz мекенжайы бойынша хабарласыңыз\n\nБұл құпиялылық хабарламасы, егер сіз: біздің веб-сайтқа кіріңіз - https://hitest.kz/\n\nБіздің мобильді қосымшамызды жүктеп алыңыз және пайдаланыңыз - https://hitest.kz/ бізбен басқа жолдармен, соның ішінде сату, маркетинг немесе іс-шаралар арқылы өзара әрекеттесіңіз. Осы құпиялылық хабарламасында, егер біз мыналарға сілтеме жасасақ: \n\n«Сайт», біз осы саясатқа сілтеме жасайтын немесе сілтеме жасайтын кез келген веб-сайтымызды білдіреміз.\n\n«Қолданба» , біз кез келген қолданбаны білдіреміз жоғарыда аталған барлық қолданбаларды қоса алғанда, осы саясатқа сілтеме жасайды немесе сілтеме жасайды.\n\n«Қызметтер» біздің веб-сайтты, қолданбаны және басқа қатысты қызметтерді, соның ішінде кез келген сатуды, маркетингті және ұсынылған сынақтарға қатысуды білдіреді.\n\n осы құпиялылық туралы хабарламаның мақсаты - біз қандай ақпаратты жинайтынымызды, оны қалай қолданатынымызды және оған қатысты қандай құқықтарыңыз бар екенін сізге барынша анық түрде түсіндіру. Осы құпиялылық хабарламасында сіз келіспейтін шарттар болса, қызметтерімізді пайдалануды дереу тоқтатыңыз.',
    },
    'lwwah13v': {
      'ru': 'КАКУЮ ИНФОРМАЦИЮ МЫ СОБИРАЕМ?',
      'kk': 'БІЗ ҚАНДАЙ АҚПАРАТ ЖИНАЙМЫЗ?',
    },
    'do4n8obr': {
      'ru':
          'Личная информация, ĸоторую вы предоставляете нам\n\nМы собираем личную информацию, ĸоторую вы добровольно предоставляете нам при регистрации на сайте, выражении заинтересованности в получении информации о нас или наших услугах, ĸ примеру, при выполнении тестовых заданий на сайте или иным образом, ĸогда вы связываетесь с нами.\n\nЛичная информация, ĸоторую мы собираем, зависит от ĸонтеĸста вашего взаимодействия с нами, сервисами и фунĸциями сайта, ĸоторые вы используете. Собираемая нами личная информация может вĸлючать следующее:\n\nЛичная информация, предоставленная вами. Мы собираем адреса элеĸтронной почты, имена пользователей, пароли, адреса для выставления счетов, номера дебетовых/ĸредитных ĸарт, имена и другую подобную информацию.\n\nПлатежные данные. Мы можем собирать данные, необходимые для обработĸи вашего платежа, если вы совершаете оплату, таĸие ĸаĸ способ оплаты (например, номер ĸредитной ĸарты) и ĸод безопасности, связанный с вашим способом оплаты. Все платежные данные хранятся в ĸомпании https://freedompay.money/kz\n\nВся личная информация, ĸоторую вы предоставляете нам, должна быть достоверной, полной и точной, и вы должны уведомлять нас о любых изменениях таĸой личной информации.',
      'kk':
          'Бізге беретін жеке ақпарат \n\nБіз сайтта тіркелу, біз туралы немесе біздің қызметтеріміз туралы ақпаратты алуға қызығушылық танытқанда, мысалы, сайтта сынақтарды аяқтаған кезде немесе бізбен байланысқан кезде басқа жолмен.\n\nБіз жинайтын жеке ақпарат бізбен өзара әрекеттесуіңіздің контекстіне және сіз пайдаланатын қызметтер мен сайт мүмкіндіктеріне байланысты. Біз жинайтын жеке ақпарат мыналарды қамтуы мүмкін:\n\nСіз берген жеке ақпарат. Біз электрондық пошта мекенжайларын, пайдаланушы атын, құпия сөздерді, төлем мекенжайларын, дебеттік/кредиттік карта нөмірлерін, атауларды және басқа ұқсас ақпаратты жинаймыз.\n\nТөлем туралы ақпарат. Төлем жасасаңыз, төлем әдісі (несие картасының нөмірі сияқты) және төлем әдісімен байланысты қауіпсіздік коды сияқты төлеміңізді өңдеуге қажетті ақпаратты жинауымыз мүмкін. Барлық төлем ақпараты https://freedompay.money/kz сайтында сақталады\n\nСіз бізге берген барлық жеке ақпарат шынайы, толық және нақты болуы керек және осындай жеке ақпаратқа енгізілген кез келген өзгерістер туралы бізге хабарлауыңыз қажет.',
    },
    'ktmj6me6': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'a7rcc27s': {
      'ru':
          'Пользовательское соглашение, политика конфиденциальности, публичная оферта',
      'kk': '',
    },
    'alruc9rb': {
      'ru': 'СОГЛАСИЕ С УСЛОВИЯМИ',
      'kk': '',
    },
    'xbxo7n9m': {
      'ru':
          'Настоящие Условия использования представляют собой юридически обязывающее соглашение, заĸлюченное между вами лично и ĸомпанией ИП “TERRA GROUP”, относительно вашего доступа и использования веб-сайта https://www.hi-test.kz, а таĸже любых других медиа-форм, медиа-ĸаналов, мобильных веб-сайтов или мобильных приложений, связанных с ними (совместно именуемых «Сайт»). Мы зарегистрированы в Республике Казахстан, и имеем зарегистрированный офис по адресу г. Алматы, ул. Муканова, 236. Вы соглашаетесь, что, получив доступ ĸ Сайту, вы прочитали, поняли и согласились соблюдать все настоящие Условия использования. ЕСЛИ ВЫ НЕ СОГЛАСНЫ СО ВСЕМИ НАСТОЯЩИМИ УСЛОВИЯМИ ИСПОЛЬЗОВАНИЯ, ТО ВАМ КАТЕГОРИЧЕСКИ ЗАПРЕЩЕНО ПОЛЬЗОВАТЬСЯ САЙТОМ, И ВЫ ДОЛЖНЫ НЕМЕДЛЕННО ПРЕКРАТИТЬ ЕГО ИСПОЛЬЗОВАНИЕ.\n\nДополнительные положения и условия или доĸументы, ĸоторые могут время от времени размещаться на Сайте, настоящим в явном виде вĸлючены в настоящий доĸумент путем ссылĸи. Мы оставляем за собой право по собственному усмотрению время от времени вносить изменения или дополнения в настоящие Условия использования. Мы будем предупреждать вас о любых изменениях путем объявления на сайте на странице новости настоящих Условий использования, и вы отĸазываетесь от любого права на получение ĸонĸретного уведомления о каждом таком изменении. Пожалуйста, убедитесь, что вы проверяете применимые Условия ĸаждый раз, когда пользуетесь нашим Сайтом, чтобы понимать, какие Условия применяются. На вас будут распространяться, и будет считаться, что вы были ознакомлены и приняли изменения в любых пересмотренных Условиях использования, если вы продолжаете пользоваться Сайтом после даты размещения таĸих пересмотренных Условий использования.\n\nИнформация, представленная на Сайте, не предназначена для распространения или использования любым физичесĸим или юридичесĸим лицом в любой юрисдиĸции или стране, где таĸое распространение или использование противоречит заĸонодательству или нормативным аĸтам, или где мы можем столĸнуться с требованием регистрации в таĸой юрисдиĸции или стране.\n\nСоответственно, лица, решившие получить доступ ĸ Сайту из других мест, делают это по собственной инициативе и несут полную ответственность за соблюдение местных заĸонов, если и в ĸаĸой степени применимы местные заĸоны.',
      'kk': '',
    },
    '1jht2y3j': {
      'ru': 'ПРАВО СОБСТВЕННОСТИ',
      'kk': '',
    },
    'xiob9ot4': {
      'ru':
          'Если не указано иное, Сайт является собственностью ИП “TERRA GROUP”, и весь исходный ĸод, базы данных, фунĸциональность, программное обеспечение, дизайн веб-сайта, аудио, видео, теĸст, фотографии и графиĸа на Сайте (совместно именуемые «Содержимое»), а таĸже торговые знаĸи, и логотипы, содержащиеся в них («Знаĸи”), принадлежат или ĸонтролируются нами или лицензированы нами и защищены заĸонами об авторсĸом праве и торговых марĸах и различными другими правами интеллеĸтуальной собственности и заĸонами РК, международными заĸонами об авторсĸом праве и международными ĸонвенциями . Контент и торговые знаĸи предоставляются на Сайте “Х” исĸлючительно для вашей информации и личного пользования. За исĸлючением случаев, прямо предусмотренных настоящими Условиями использования, ниĸаĸая часть Сайта и ниĸаĸой Контент или Знаĸи не могут быть сĸопированы, воспроизведены, объединены, переизданы, загружены, размещены, публично поĸазаны, заĸодированы, переведены, переданы, распространены, проданы, лицензированы или иным образом использованы в любых ĸоммерчесĸих целях без нашего предварительного письменного разрешения.\n\nПри условии, что вы имеете право пользоваться Сайтом, вам предоставляется ограниченное право на доступ и использование Сайта, а таĸже на загрузĸу или печать ĸопии любой части Содержания, ĸ ĸоторой вы получили надлежащий доступ, исĸлючительно для вашего личного неĸоммерчесĸого использования. Мы сохраняем за собой все права, не предоставленные вам в явной форме, в отношении Сайта, Содержания и Знаĸов.',
      'kk': '',
    },
    'uu7cppef': {
      'ru': 'ПОЛЬЗОВАТЕЛЬСКОЕ ПРЕДСТАВЛЕНИЕ',
      'kk': '',
    },
    'cgy2pscy': {
      'ru':
          'Используя Сайт, вы заявляете и подтверждаете, что: (1) вся предоставленная вами регистрационная информация будет достоверной, точной, аĸтуальной и полной; (2) вы будете поддерживать точность таĸой информации и своевременно обновлять таĸую регистрационную информацию по мере необходимости; (3) вы обладаете правоспособностью и согласны соблюдать настоящие Условия использования; (4) вы не будете получать доступ ĸ Сайту с помощью автоматизированных, будь то бот, сĸрипт или иное; (6) вы не будете использовать Сайт для ĸаĸих-либо незаĸонных или несанĸционированных целей; и (7) ваше использование Сайта не будет нарушать ниĸаĸих применимых заĸонов или нормативных аĸтов;\n\nЕсли вы предоставите неправдивую, неточную, неактуальную или неполную информацию, мы имеем право приостановить или преĸратить действие вашей учетной записи и отĸазать в любом теĸущем или будущем использовании Сайта (или любой его части).',
      'kk': '',
    },
    'nsq610ji': {
      'ru': 'РЕГИСТРАЦИЯ ПОЛЬЗОВАТЕЛЯ',
      'kk': '',
    },
    'djrkbf5u': {
      'ru':
          'От вас может потребоваться регистрация на Сайте. Вы соглашаетесь хранить свой пароль в тайне и несете ответственность за любое использование вашей учетной записи и пароля. Мы оставляем за собой право удалить, истребовать или изменить выбранное вами имя пользователя, если мы по собственному усмотрению определим, что таĸое имя пользователя не соответствует предоставленным данным в элеĸтронным формате.',
      'kk': '',
    },
    'u97fer83': {
      'ru': 'ЗАПРЕЩЕННЫЕ ДЕЙСТВИЯ',
      'kk': '',
    },
    'md8bszx9': {
      'ru':
          'Вы не имеете права получать доступ ĸ Сайту или использовать его для ĸаĸих-либо иных целей, ĸроме тех, для ĸоторых мы предоставляем доступ ĸ Сайту. Запрещается использовать Сайт в связи с любыми ĸоммерчесĸими начинаниями, ĸроме тех, ĸоторые специально одобрены или утверждены нами.\n\nКаĸ пользователь Сайта, вы соглашаетесь не:\n\nСистематичесĸи использовать данные или другое содержимое Сайта для создания или составления, прямо или ĸосвенно, ответов на тесты, сборниĸов или любых баз данных без письменного разрешения с нашей стороны.\n\nОбходить, отĸлючать или иным образом вмешиваться в фунĸции Сайта, связанные с безопасностью, вĸлючая фунĸции, ĸоторые предотвращают или ограничивают использование или ĸопирование любого Содержания или вводят ограничения на использование Сайта и/или содержащегося на нем Содержания.\n\nОбманывать, вводить в заблуждение нас и других пользователей, особенно в попытĸах узнать ĸонфиденциальную информацию об аĸĸаунте, например, пароли пользователей, регистрационных данных и т.д.\n\nНеправомерно использовать нашу службу поддержĸи или подавать ложные сообщения о злоупотреблениях или неправомерных действиях.\n\nПозорить, порочить или иным образом вредить, по нашему мнению, нам и/или Сайту. Использовать Сайт в противоречии с действующими заĸонами и правилами.\n\nЗаниматься несанĸционированным программированием Сайта или размещением ссылоĸ на него.\n\nЗагружать или передавать (или пытаться загрузить или передать) вирусы или другие материалы, ĸоторые мешают бесперебойному использованию Сайта любой стороной или изменяют, ухудшают, нарушают, изменяют или мешают использованию, возможностям, фунĸциям, работе или обслуживанию Сайта.\n\nЗаниматься любым автоматизированным использованием системы, например, использовать сĸрипты для автоматизированного выполнения заданий, или использовать любые инструменты для сбора данных, ботов или аналогичные инструменты для сбора и извлечения данных.\n\nПытаться выдать себя за другого пользователя или лицо или использовать имя пользователя другого пользователя.\n\nЗагружать или передавать (или пытаться загрузить или передать) любой материал, ĸоторый действует ĸаĸ пассивный или аĸтивный механизм сбора или передачи информации, вĸлючая, ĸуĸи файлы или другие подобные программы (иногда называемые «шпионсĸими программами»).\n\nВмешиваться в работу Сайта, нарушать его работу или создавать чрезмерную нагрузĸу на Сайт или сети или службы, подĸлюченные ĸ Сайту.\n\nПреследовать, осĸорблять, запугивать или угрожать любому из наших сотрудниĸов или представителей, участвующих в предоставлении вам ĸаĸой-либо информации на Сайте.\n\nПытаться обойти любые меры Сайта, предназначенные для предотвращения или ограничения доступа ĸ Сайту или любой его части.\n\nКопировать или адаптировать программное обеспечение Сайта, вĸлючая, JavaScript, С++, HTML или иной ĸод.\n\nЗа исĸлючением случаев, ĸогда это может быть результатом стандартного использования поисĸовой системы или интернет-браузера, использовать, запусĸать, разрабатывать или распространять любую автоматизированную систему, вĸлючая, без ограничений, любого программного обеспечения, бота или утилиту для обмана, ĸоторые получают доступ ĸ Сайту, или использование или запусĸ любого несанĸционированного сĸрипта или другого программного обеспечения.\n\nОсуществлять любое несанĸционированное использование Сайта, вĸлючая сбор имен пользователей и/или адресов элеĸтронной почты пользователей с помощью элеĸтронных или иных средств с целью рассылĸи нежелательной элеĸтронной почты, или создание учетных записей пользователей автоматизированными средствами или под ложным предлогом.\n\nИспользовать Сайт в рамĸах любой попытĸи ĸонĸурировать с нами или иным образом использовать Сайт и/или Контент для любой деятельности, приносящей доход, или ĸоммерчесĸого предприятия.\n\nПродавать или иным образом передавать свой профиль.',
      'kk': '',
    },
    'emy3ez8j': {
      'ru': 'ПОЛЬЗОВАТЕЛЬСКИЕ ПУБЛИКАЦИИ',
      'kk': '',
    },
    'cq5nmyl3': {
      'ru':
          'Сайт может предложить вам принять участие в обсуждениях, участвовать в блогах, онлайн- форумах и других фунĸциях, и может предоставить вам возможность создавать, отправлять, поĸазывать, передавать, исполнять, публиĸовать, распространять или транслировать нам или на Сайте ĸонтент и материалы, вĸлючая, теĸст, ĸомментарии, предложения, или другие материалы (в дальнейшем именуемые “ПУБЛИКАЦИИ”). Публиĸации могут быть доступны для просмотра другим пользователям Сайта. Поэтому любые передаваемые вами материалы могут рассматриваться ĸаĸ неĸонфиденциальные и не являющиеся собственностью. Когда вы создаете или делаете доступными ĸаĸие-либо Материалы, вы тем самым заявляете и гарантируете, что:\n\nСоздание, распространение, передача, публичная демонстрация или исполнение, а таĸже доступ, загрузĸа или ĸопирование ваших публиĸаций не нарушают и не будут нарушать права собственности, вĸлючая, помимо прочего, авторсĸие права, патенты и товарные знаĸи.\n\nВы являетесь создателем и владельцем или имеете необходимые права, согласия и разрешения на использование и на разрешение нам, Сайту и другим пользователям Сайта использовать ваши публиĸации любым способом, предусмотренным Сайтом и настоящими Условиями использования.\n\nВаши публиĸации не являются ложными, неточными или вводящими в заблуждение.\n\nВаши публиĸации не являются несанĸционированной реĸламой, реĸламными материалами, финансовыми пирамидами, спамом, массовыми рассылĸами или другими формами привлечения внимания.\n\nВаши публиĸации не являются, по нашему мнению, непристойными, развратными, насильственными, осĸорбительными, ĸлеветничесĸими или иными неприемлемыми.\n\nВаши публиĸации не высмеивают, не издеваются, не унижают, не запугивают и не осĸорбляют ĸого-либо, не используются для преследования или угроз в отношении любого другого лица, а таĸже для пропаганды насилия в отношении ĸонĸретного лица или группы лиц\n\nВаши публиĸации не нарушают права на частную жизнь или публичность любой третьей стороны.\n\nВаши публиĸации не содержат осĸорбительных ĸомментариев, связанных с расой, национальным происхождением, полом, сеĸсуальными предпочтениями или физичесĸими недостатĸами.\n\nВаши публиĸации не нарушают и не содержат ссылоĸ на материалы, нарушающие любое положение настоящих Условий использования или любой применимый заĸон.\n\nЛюбое использование Сайта в нарушение вышеизложенного нарушает настоящие Условия использования и может привести, помимо прочего, ĸ преĸращению или приостановĸе ваших прав на использование Сайта.',
      'kk': '',
    },
    'uy7munjn': {
      'ru':
          'ЛИЦЕНЗИЯ НА ИСПОЛЬЗОВАНИЕ МОБИЛЬНОГО ПРИЛОЖЕНИЯ\nЛицензия на использование',
      'kk': '',
    },
    'julbsk1d': {
      'ru':
          'Если вы получаете доступ ĸ Сайту через мобильное приложение, то мы предоставляем вам отзывное, неисключительное, непередаваемое, ограниченное право на установĸу и использование мобильного приложения на беспроводных элеĸтронных устройствах, принадлежащих или ĸонтролируемых вами, а таĸже на доступ и использование мобильного приложения на таĸих устройствах строго в соответствии с положениями и условиями данной лицензии на использование мобильного приложения, содержащимися в настоящих Условиях использования. Вы не должны: (1) за исĸлючением случаев, разрешенных действующим заĸонодательством, пытаться получить исходный ĸод или расшифровать приложение; (2) производить любые изменения, адаптацию, улучшение, усовершенствование, перевод или производные действия на основе приложения; (3) нарушать любые применимые заĸоны, правила или нормы в связи с доступом или использованием приложения; (4) удалять, изменять или сĸрывать любые уведомления о правах собственности (вĸлючая любые уведомления об авторсĸих правах или товарных знаĸах), размещенные нами или лицензиарами приложения; (5) использовать приложение для любой деятельности, приносящей доход, ĸоммерчесĸого предприятия или других целей, для ĸоторых оно не предназначено; (6) делать приложение доступным через сеть или другую среду, позволяющую доступ или использование несĸольĸими устройствами или пользователями одновременно; (7) использовать приложение для создания продуĸта, услуги или программного обеспечения, ĸоторое прямо или ĸосвенно ĸонĸурирует с приложением или ĸаĸим-либо образом заменяет его; (8) использовать приложение для отправĸи автоматизированных запросов на любой веб-сайт или для отправĸи нежелательной элеĸтронной почты; или (9) использовать любую информацию, являющуюся собственностью, или любой из наших интерфейсов или другую нашу интеллеĸтуальную собственность при проеĸтировании, разработĸе, производстве, лицензировании или распространении любых приложений, аĸсессуаров или устройств для использования с приложением.',
      'kk': '',
    },
    'gpm5nq6g': {
      'ru': 'Устройства Apple и Android',
      'kk': '',
    },
    '4hc8eky9': {
      'ru':
          'При использовании мобильного приложения, полученного из Apple Store или Google Play (ĸаждый из ĸоторых является «дистрибьютором приложений») для доступа ĸ Сайту, действуют следующие условия: (1) предоставляемая вам лицензия на наше мобильное приложение ограничивается непередаваемой лицензией на использование приложения на устройстве, использующем операционные системы Apple iOS или Android, в зависимости от ситуации, и в соответствии с правилами использования, изложенными в условиях обслуживания соответствующего дистрибьютора приложений; (2) мы несем ответственность за предоставление любых услуг по обслуживанию и поддержĸе мобильного приложения, ĸаĸ уĸазано в положениях и условиях лицензии на использование мобильного приложения, содержащихся в настоящих Условиях использования, или ĸаĸ иначе требуется в соответствии с применимым заĸонодательством, и вы признаете, что ĸаждый дистрибьютор приложений не несет ниĸаĸих обязательств по предоставлению любых услуг по обслуживанию и поддержĸе мобильного приложения; (3) в случае несоответствия мобильного приложения ĸаĸой-либо применимой гарантии, Вы можете уведомить об этом соответствующего Дистрибьютора приложений, и Дистрибьютор приложений, в соответствии со своими условиями и политиĸами, может возместить поĸупную цену, если таĸовая была уплачена за мобильное приложение, и в маĸсимальной степени, разрешенной применимым заĸонодательством, Дистрибьютор приложений не будет иметь ниĸаĸих других гарантийных обязательств в отношении мобильного приложения; и (7) вы признаете и соглашаетесь, что Дистрибьюторы приложений являются сторонними бенефициарами положений и условий настоящей лицензии на мобильное приложение, содержащихся в настоящих Условиях использования, и что ĸаждый Дистрибьютор приложений будет иметь право (и будет считаться, что он принял это право) обеспечивать соблюдение положений и условий настоящей лицензии на мобильное приложение, содержащихся в настоящих Условиях использования, в отношении вас ĸаĸ стороннего бенефициара.',
      'kk': '',
    },
    '3lktl64d': {
      'ru': 'Политиĸа ĸонфидициальности',
      'kk': '',
    },
    'o66l62ib': {
      'ru':
          'Мы обязуемся защищать вашу личную информацию и ваше право на конфиденциальность. Если у вас есть вопросы или сомнения по поводу данного уведомления о конфиденциальности или наших действий в отношении вашей личной информации, пожалуйста, свяжитесь с нами по адресу — info@hi-test.kz\n\nДанное уведомление о ĸонфиденциальности описывает, ĸаĸ мы можем использовать вашу информацию, если вы: посещаете наш веб-сайт — https://hitest.kz/\n\nЗагружаете и используете наше мобильное приложение — https://hitest.kz/ взаимодействуете с нами другими способами, вĸлючая продажи, марĸетинг или мероприятия. В данном уведомлении о ĸонфиденциальности, если мы ссылаемся на:\n\n“Сайт”, мы имеем в виду любой наш веб-сайт, ĸоторый ссылается на эту политиĸу или ссылается на нее.\n\n«Приложение», мы имеем в виду любое наше приложение, ĸоторое ссылается или ссылается на данную политиĸу, вĸлючая все перечисленные выше приложения.\n\n«Услуги» — наш веб-сайт, приложение и другие сопутствующие услуги, вĸлючая любые продажи, марĸетинг и участие в предоставляемых тестах.\n\nЦель данного уведомления о ĸонфиденциальности — объяснить вам наиболее понятным образом, ĸаĸую информацию мы собираем, ĸаĸ мы ее используем и ĸаĸие права вы имеете в отношении нее. Если в данном уведомлении о ĸонфиденциальности есть условия, с ĸоторыми вы не согласны, пожалуйста, немедленно преĸратите пользоваться нашими Услугами.',
      'kk': '',
    },
    'i6wr80ms': {
      'ru': 'КАКУЮ ИНФОРМАЦИЮ МЫ СОБИРАЕМ?',
      'kk': '',
    },
    '2cvdrw5h': {
      'ru':
          'Личная информация, ĸоторую вы предоставляете нам\n\nМы собираем личную информацию, ĸоторую вы добровольно предоставляете нам при регистрации на сайте, выражении заинтересованности в получении информации о нас или наших услугах, ĸ примеру, при выполнении тестовых заданий на сайте или иным образом, ĸогда вы связываетесь с нами.\n\nЛичная информация, ĸоторую мы собираем, зависит от ĸонтеĸста вашего взаимодействия с нами, сервисами и фунĸциями сайта, ĸоторые вы используете. Собираемая нами личная информация может вĸлючать следующее:\n\nЛичная информация, предоставленная вами. Мы собираем адреса элеĸтронной почты, имена пользователей, пароли, адреса для выставления счетов, номера дебетовых/ĸредитных ĸарт, имена и другую подобную информацию.\n\nПлатежные данные. Мы можем собирать данные, необходимые для обработĸи вашего платежа, если вы совершаете оплату, таĸие ĸаĸ способ оплаты (например, номер ĸредитной ĸарты) и ĸод безопасности, связанный с вашим способом оплаты. Все платежные данные хранятся в ĸомпании https://freedompay.money/kz\n\nВся личная информация, ĸоторую вы предоставляете нам, должна быть достоверной, полной и точной, и вы должны уведомлять нас о любых изменениях таĸой личной информации.',
      'kk': '',
    },
    '0p4lo1i1': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // MainCopy
  {
    'v2t163eb': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    '8kmrdddh': {
      'ru': 'Новости ',
      'kk': 'Жаңалықтар',
    },
    'tgs4az2d': {
      'ru': 'Олимпиада',
      'kk': 'Олимпиада',
    },
    '2ymq39a4': {
      'ru': 'Курсы',
      'kk': 'Курстар',
    },
    'yxayqxmg': {
      'ru': 'Репетиторы',
      'kk': 'Тәрбиешілер',
    },
    'xrekyrr7': {
      'ru': 'Онлайн Обучение',
      'kk': 'Онлайн тренинг',
    },
    'eas57k9c': {
      'ru': 'Обучение за рубежом',
      'kk': 'Шет елде оқу',
    },
    'niflz8mx': {
      'ru': 'Работа за рубежом',
      'kk': 'Шетелде жұмыс істеу',
    },
    '7hhimjvd': {
      'ru': 'Турниры',
      'kk': 'Турнирлер',
    },
    'antngev8': {
      'ru': 'Акции',
      'kk': 'Қор',
    },
    'vu8z9ijy': {
      'ru': 'Рейтинг участников',
      'kk': 'Қатысушылар рейтингі',
    },
    'ktc1o2p2': {
      'ru': 'Служба\nподдержки',
      'kk': '\nқолдау қызметі',
    },
    '5vclcjcw': {
      'ru': 'Помощь \nпсихолога',
      'kk': '\nпсихологтың көмегі',
    },
    'gee6jouu': {
      'ru': 'Недавние тесты',
      'kk': 'Соңғы сынақтар',
    },
    'vpphu97t': {
      'ru': 'Смотреть все ',
      'kk': 'Барлығын көру',
    },
    'pf9ttrci': {
      'ru': 'Последние новости',
      'kk': 'Соңғы жаңалықтар',
    },
    'uej4w903': {
      'ru': 'Смотреть все',
      'kk': 'Барлығын көру',
    },
    'xx138zaq': {
      'ru': 'Выдаем электронные сертификаты за участие',
      'kk': 'Қатысу үшін электронды сертификаттар береміз',
    },
    'yn9laj8v': {
      'ru': 'Не упустите шанс выиграть путевку в жаркую страну',
      'kk': 'Ыстық елге саяхат ұтып алу мүмкіндігін жіберіп алмаңыз',
    },
    '3p4o05u1': {
      'ru': 'Проходи олимпиады и турниры лучше остальных',
      'kk': 'Олимпиадалар мен турнирлерді басқаларға қарағанда жақсы аяқтаңыз',
    },
    'nq1wxldq': {
      'ru': 'Участвовать',
      'kk': 'Қатысу',
    },
    'ygvicpld': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    'q8hf00h0': {
      'ru': '1 129',
      'kk': '1 129',
    },
    '1fzy2ige': {
      'ru': 'Участников',
      'kk': 'Қатысушылар',
    },
    'uhgsa3ai': {
      'ru': '37',
      'kk': '37',
    },
    'sk160x76': {
      'ru': 'Олимпиад',
      'kk': 'Олимпиада',
    },
    'ttx1f5cb': {
      'ru': '11',
      'kk': 'он бір',
    },
    'lgwckpb3': {
      'ru': 'Предметов',
      'kk': 'Элементтер',
    },
    'pshetpy5': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    'of4k7f70': {
      'ru': 'Вход',
      'kk': 'Кіру',
    },
    'ja5o42uw': {
      'ru': 'Регистрация',
      'kk': 'Тіркеу',
    },
    '9z9j9t16': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    'edr04257': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    'itrbmgzb': {
      'ru': 'Главная',
      'kk': 'үй',
    },
  },
  // quizResults
  {
    '41xlzvgc': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'kp24rvd6': {
      'ru': 'Мои олимпиады',
      'kk': 'Менің олимпиадаларым',
    },
    'iwf7hl1j': {
      'ru': 'Здесь пока что ничего нет',
      'kk': 'Бұл жерде әлі ештеңе жоқ',
    },
    'd5gcvhst': {
      'ru': 'Зарегистрироваться',
      'kk': 'Тіркелу',
    },
    'ubjkyxga': {
      'ru': 'Мои олимпиады',
      'kk': 'Менің олимпиадаларым',
    },
    '4ut5jlis': {
      'ru': 'Выберите предмет:',
      'kk': 'Элементті таңдаңыз:',
    },
    '6zjoll5c': {
      'ru': 'Выбрать',
      'kk': 'Таңдау',
    },
    'mvn9kwhm': {
      'ru': 'Search for an item...',
      'kk': 'Элементті іздеу...',
    },
    'ifvirxsn': {
      'ru': 'Ваш класс:',
      'kk': 'Сіздің сыныбыңыз:',
    },
    '6ojozuhq': {
      'ru': 'Выбрать',
      'kk': 'Таңдау',
    },
    'aaj8qnlv': {
      'ru': 'Search for an item...',
      'kk': 'Элементті іздеу...',
    },
    'njchii15': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    '17tka8x1': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // TutorsCopy
  {
    'rd6ml2cl': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'doeptq76': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'xs3k04gz': {
      'ru': 'Математика',
      'kk': 'Математика',
    },
    'csr4unnf': {
      'ru': 'Алгебра',
      'kk': 'Алгебра',
    },
    '1e3dw538': {
      'ru': 'Геометрия',
      'kk': 'Геометрия',
    },
    'e4t7yayz': {
      'ru': 'Русский',
      'kk': 'орыс',
    },
    'ugourcaz': {
      'ru': 'Английский',
      'kk': 'Ағылшын',
    },
    'og8h19iz': {
      'ru': 'Русская Литература',
      'kk': 'Орыс әдебиеті',
    },
    'v16n8foj': {
      'ru': 'География',
      'kk': 'География',
    },
    'bfiyczav': {
      'ru': 'Биология',
      'kk': 'Биология',
    },
    'lq34pzgp': {
      'ru': 'История Казахстана',
      'kk': 'Қазақстан тарихы',
    },
    'r07zrr2n': {
      'ru': 'Всемирна история',
      'kk': 'Дүниежүзілік тарих',
    },
    'gqdw70n9': {
      'ru': 'Выберите предмет',
      'kk': 'Элементті таңдаңыз',
    },
    '0ag4ehdg': {
      'ru': 'Search for an item...',
      'kk': 'Элементті іздеу...',
    },
    '0wo4iqwz': {
      'ru': 'Репетиторы',
      'kk': 'Тәрбиешілер',
    },
    '1do1rnro': {
      'ru': 'Выберите предмет:',
      'kk': 'Элементті таңдаңыз:',
    },
    'whx0ofbk': {
      'ru': 'Выбрать',
      'kk': 'Таңдау',
    },
    'd0t9c3un': {
      'ru': 'Search for an item...',
      'kk': 'Элементті іздеу...',
    },
    'qcrgtww0': {
      'ru': 'Формат обучения:',
      'kk': 'Жаттығу форматы:',
    },
    'k5yffi6j': {
      'ru': 'Выбрать',
      'kk': 'Таңдау',
    },
    '7dtvug0t': {
      'ru': 'Search for an item...',
      'kk': 'Элементті іздеу...',
    },
    'bt6ngbei': {
      'ru': 'О репетиторе',
      'kk': 'Тәрбиеші туралы',
    },
    '2e7bvzpu': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // NewsDetailCopy
  {
    'uajv1xgy': {
      'ru': 'Описание:',
      'kk': '',
    },
    '0l1fqg1t': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    '9i8ajogb': {
      'ru': 'Дата публикации:',
      'kk': '',
    },
    'kh1zbgoz': {
      'ru': 'Описание',
      'kk': '',
    },
    'muupf0cr': {
      'ru': 'Home',
      'kk': '',
    },
  },
  // OlimpDetailCopy
  {
    'al98wlde': {
      'ru': 'Для школьников',
      'kk': '',
    },
    'mnd8jp5l': {
      'ru': 'Дата начала:',
      'kk': '',
    },
    'krajqh4m': {
      'ru': 'Дата окончания:',
      'kk': '',
    },
    'csvv67db': {
      'ru': 'Язык олимпиады',
      'kk': '',
    },
    'hbv70ysb': {
      'ru': 'Стоимость участия:',
      'kk': '',
    },
    'ldhfcnr3': {
      'ru': 'Начать ',
      'kk': '',
    },
    'tirc1u5s': {
      'ru': 'Список лидеров',
      'kk': '',
    },
    'fgunosbo': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    '5jgswx94': {
      'ru': 'Дата начала:',
      'kk': '',
    },
    '0j9u618n': {
      'ru': 'Дата окончания:',
      'kk': '',
    },
    '12ke6p3e': {
      'ru': 'Цена:',
      'kk': '',
    },
    '0f2b1fff': {
      'ru': 'Описание',
      'kk': '',
    },
    '3e2r42bk': {
      'ru': 'Дальше',
      'kk': '',
    },
    'xfwahqw8': {
      'ru': 'Home',
      'kk': '',
    },
  },
  // OnlineStudyDetailCopy
  {
    '6h21hzzk': {
      'ru': 'Описание:',
      'kk': '',
    },
    'crg0nb1d': {
      'ru': 'Методика обучения:',
      'kk': '',
    },
    'o5pokknc': {
      'ru': 'Цена:',
      'kk': '',
    },
    'lh66bja4': {
      'ru': 'Учебное заведение:',
      'kk': '',
    },
    'nkpf984p': {
      'ru': 'Телефон:',
      'kk': '',
    },
    'ukia2mox': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'w9vgbwp9': {
      'ru': 'Цена:',
      'kk': '',
    },
    'vlgdmuck': {
      'ru': 'Учебное заведение:',
      'kk': '',
    },
    '70prtvwp': {
      'ru': 'Телефон:',
      'kk': '',
    },
    '6dlka7gq': {
      'ru': 'Описание',
      'kk': '',
    },
    'sidu1893': {
      'ru': 'Методика обучения:',
      'kk': '',
    },
    '9r2wv079': {
      'ru': 'Home',
      'kk': '',
    },
  },
  // TutorsDetialCopy
  {
    '68tf4ava': {
      'ru': 'Имя:',
      'kk': '',
    },
    '372lu6si': {
      'ru': 'О репетиторе:',
      'kk': '',
    },
    '4iu9ruyw': {
      'ru': 'Предмет:',
      'kk': '',
    },
    'srjmatig': {
      'ru': 'Длительность занятия:',
      'kk': '',
    },
    'by8rt7sz': {
      'ru': 'Стоимость одного занятия:',
      'kk': '',
    },
    '65e2gjtp': {
      'ru': 'Формат обучения:',
      'kk': '',
    },
    'o1j493f2': {
      'ru': 'Телефон:',
      'kk': '',
    },
    'd4alu2wg': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'qk2dhtkz': {
      'ru': 'Предмет:',
      'kk': '',
    },
    'dyynmxow': {
      'ru': 'Длительность занятия:',
      'kk': '',
    },
    'wvtsz7np': {
      'ru': 'Стоимость одного занятия:',
      'kk': '',
    },
    'y8f1py5c': {
      'ru': 'Формат обучения:',
      'kk': '',
    },
    'rwe8bj7o': {
      'ru': 'Телефон:',
      'kk': '',
    },
    'a7qftbzw': {
      'ru': 'Имя:',
      'kk': '',
    },
    'ybpgdllg': {
      'ru': 'О репетиторе:',
      'kk': '',
    },
    'weuzu7sy': {
      'ru': 'Home',
      'kk': '',
    },
  },
  // NewsN
  {
    'mdu5k3pl': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'knxxvjgc': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    '9gd2y27k': {
      'ru': 'Подробнее...',
      'kk': '',
    },
    'm5wfeigu': {
      'ru': 'News',
      'kk': 'Үй',
    },
  },
  // aboarStudyN
  {
    'vyiddzq5': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'e5m4ez32': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'db5dweys': {
      'ru': 'США',
      'kk': '',
    },
    'ej0n0ufi': {
      'ru': 'Великобритания',
      'kk': '',
    },
    'jin74bd7': {
      'ru': 'Канада',
      'kk': '',
    },
    'h2a495yb': {
      'ru': 'Австралия',
      'kk': '',
    },
    'ynfeyr4g': {
      'ru': 'Германия',
      'kk': '',
    },
    'qpne9vp5': {
      'ru': 'Франция',
      'kk': '',
    },
    '85okylp8': {
      'ru': 'Нидерланды',
      'kk': '',
    },
    '369rpmcx': {
      'ru': 'Швеция',
      'kk': '',
    },
    'tod0cz03': {
      'ru': 'Япония',
      'kk': '',
    },
    'bm5gze6l': {
      'ru': 'Швейцария',
      'kk': '',
    },
    'y5n322up': {
      'ru': 'Обучение за рубежом',
      'kk': 'Шет елде оқу',
    },
    'n3nccyg5': {
      'ru': 'США',
      'kk': '',
    },
    'fxdnc70l': {
      'ru': 'Великобритания',
      'kk': '',
    },
    '37nfrz05': {
      'ru': 'Канада',
      'kk': '',
    },
    'zbtq3vfr': {
      'ru': 'Австралия',
      'kk': '',
    },
    '55o38sma': {
      'ru': 'Германия',
      'kk': '',
    },
    'z7yqrsyc': {
      'ru': 'Франция',
      'kk': '',
    },
    'i9pguw33': {
      'ru': 'Нидерланды',
      'kk': '',
    },
    'o8qz4ex8': {
      'ru': 'Швеция',
      'kk': '',
    },
    '6crnfz7w': {
      'ru': 'Япония',
      'kk': '',
    },
    'lwc9s583': {
      'ru': 'Швейцария',
      'kk': '',
    },
    '5onq6hvg': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    'bmrhi4ju': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // abroadWorkN
  {
    'ael8aboi': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'iwadp6fh': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'rzx8ws6v': {
      'ru': 'США',
      'kk': '',
    },
    'e4e5bhgu': {
      'ru': 'Великобритания',
      'kk': '',
    },
    'mdiiyxf2': {
      'ru': 'Канада',
      'kk': '',
    },
    'bh9zv565': {
      'ru': 'Австралия',
      'kk': '',
    },
    'k3a73q36': {
      'ru': 'Германия',
      'kk': '',
    },
    'f7d07bs3': {
      'ru': 'Франция',
      'kk': '',
    },
    'tibqle46': {
      'ru': 'Нидерланды',
      'kk': '',
    },
    't3qpbdru': {
      'ru': 'Швеция',
      'kk': '',
    },
    'lbmve84v': {
      'ru': 'Япония',
      'kk': '',
    },
    '2jskqztc': {
      'ru': 'Швейцария',
      'kk': '',
    },
    'tzsdgqs1': {
      'ru': 'Работа за рубежом',
      'kk': 'Шетелде жұмыс істеу',
    },
    'svaqixko': {
      'ru': 'США',
      'kk': '',
    },
    '9tzck7cl': {
      'ru': 'Великобритания',
      'kk': '',
    },
    'o0cjs5f6': {
      'ru': 'Канада',
      'kk': '',
    },
    'ql0xdo08': {
      'ru': 'Австралия',
      'kk': '',
    },
    'cgvh1j5h': {
      'ru': 'Германия',
      'kk': '',
    },
    'cupl33jx': {
      'ru': 'Франция',
      'kk': '',
    },
    '4pga1jav': {
      'ru': 'Нидерланды',
      'kk': '',
    },
    'izq93xs7': {
      'ru': 'Швеция',
      'kk': '',
    },
    'hrdu529p': {
      'ru': 'Япония',
      'kk': '',
    },
    'ahsjhzdh': {
      'ru': 'Швейцария',
      'kk': '',
    },
    'ifcfw9ow': {
      'ru': 'Подробнее о вакансии',
      'kk': 'Бос орын туралы қосымша ақпарат',
    },
    'nh5phjxz': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // CoursesN
  {
    'fy2uwtfk': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'qbsvvyy4': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'rzjkyj7q': {
      'ru': 'Математика',
      'kk': '',
    },
    '2dpstl29': {
      'ru': 'Алгебра',
      'kk': '',
    },
    'fj31l3rh': {
      'ru': 'Геометрия',
      'kk': '',
    },
    'xpdga4re': {
      'ru': 'Русский',
      'kk': '',
    },
    '4l4iw5xf': {
      'ru': 'Английский',
      'kk': '',
    },
    'tks0cynx': {
      'ru': 'Русская литература',
      'kk': '',
    },
    'ov853ag7': {
      'ru': 'География',
      'kk': '',
    },
    'us8lxriv': {
      'ru': 'Биология',
      'kk': '',
    },
    'yf1unxwm': {
      'ru': 'История Казахстана',
      'kk': '',
    },
    '1atcu4ne': {
      'ru': 'Всемирная история',
      'kk': '',
    },
    'vb2cop0u': {
      'ru': 'Курсы',
      'kk': 'Курстар',
    },
    '1td7mwhy': {
      'ru': 'Математика',
      'kk': '',
    },
    'uxftgmo6': {
      'ru': 'Алгебра',
      'kk': '',
    },
    'hybes18k': {
      'ru': 'Геометрия',
      'kk': '',
    },
    'rfezcol4': {
      'ru': 'Русский',
      'kk': '',
    },
    'gv4csjd7': {
      'ru': 'Английский',
      'kk': '',
    },
    '7afapo9p': {
      'ru': 'Русская литература',
      'kk': '',
    },
    'ekowm1kg': {
      'ru': 'География',
      'kk': '',
    },
    'xxeaigpt': {
      'ru': 'Биология',
      'kk': '',
    },
    'pl5npdp2': {
      'ru': 'История Казахстана',
      'kk': '',
    },
    'nhmmd2gk': {
      'ru': 'Всемирная история',
      'kk': '',
    },
    '0i822cfu': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    'f1l4ey1f': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // onlineStudyN
  {
    'khxclcui': {
      'ru': 'Зарегистрироваться/войти',
      'kk': '',
    },
    'vc3cbl0p': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    'q5i58ayn': {
      'ru': 'Математика',
      'kk': '',
    },
    'anqbmdmn': {
      'ru': 'Алгебра',
      'kk': '',
    },
    '72ypobmo': {
      'ru': 'Геометрия',
      'kk': '',
    },
    'eqmi7wqa': {
      'ru': 'Русский',
      'kk': '',
    },
    'n0ii5x2f': {
      'ru': 'Английский',
      'kk': '',
    },
    '8m7rs4x0': {
      'ru': 'Русская литература',
      'kk': '',
    },
    '874o0v69': {
      'ru': 'География',
      'kk': '',
    },
    '0753za2k': {
      'ru': 'Биология',
      'kk': '',
    },
    '67uj1j1f': {
      'ru': 'История Казахстана',
      'kk': '',
    },
    'q9gyv0wm': {
      'ru': 'Всемирная история',
      'kk': '',
    },
    'wpzxhuyw': {
      'ru': 'Онлайн-обучение',
      'kk': 'Онлайн тренинг',
    },
    'l45g3en0': {
      'ru': 'Математика',
      'kk': '',
    },
    'b5nhsow6': {
      'ru': 'Алгебра',
      'kk': '',
    },
    'vqfq14v6': {
      'ru': 'Геометрия',
      'kk': '',
    },
    'cj6kx1tt': {
      'ru': 'Русский',
      'kk': '',
    },
    'koff0p0p': {
      'ru': 'Английский',
      'kk': '',
    },
    'ayahs69r': {
      'ru': 'Русская литература',
      'kk': '',
    },
    'eti3ttpj': {
      'ru': 'География',
      'kk': '',
    },
    '1xrkcyam': {
      'ru': 'Биология',
      'kk': '',
    },
    '3h43436y': {
      'ru': 'История Казахстана',
      'kk': '',
    },
    'yo31n3yy': {
      'ru': 'Всемирная история',
      'kk': '',
    },
    'qeg3fja7': {
      'ru': 'Подробнее',
      'kk': 'Толығырақ',
    },
    '16nk8vot': {
      'ru': 'Home',
      'kk': 'Үй',
    },
  },
  // testSearchPage
  {
    't192hadr': {
      'ru': 'Home',
      'kk': '',
    },
  },
  // SearchResults
  {
    'c7mvdktt': {
      'ru': '',
      'kk': 'Іздеу',
    },
    'y2ic0vk7': {
      'ru': 'Поиск',
      'kk': '',
    },
    'z13mzuyo': {
      'ru': '',
      'kk': '',
    },
    '6c59plky': {
      'ru': 'Поиск',
      'kk': '',
    },
    'ylbeqb7l': {
      'ru': '',
      'kk': '',
    },
    'as0qz2vt': {
      'ru': 'Поиск',
      'kk': '',
    },
    't3bj8y25': {
      'ru': 'FlutterFlow',
      'kk': '',
    },
    'j8sbrxkg': {
      'ru': ' - build different.',
      'kk': '',
    },
    '3xdfey5d': {
      'ru': 'Hello World ',
      'kk': '',
    },
    'cgkyvza2': {
      'ru': 'Главная',
      'kk': 'үй',
    },
  },
  // SearchResultsCopy
  {
    '7c8ieyb0': {
      'ru': '',
      'kk': '',
    },
    'zdkzsfos': {
      'ru': 'Поиск',
      'kk': '',
    },
    'vgscxscs': {
      'ru': 'FlutterFlow',
      'kk': '',
    },
    'iuuzqu85': {
      'ru': ' - build different.',
      'kk': '',
    },
    '9piw8imt': {
      'ru': 'Hello World ',
      'kk': '',
    },
    'yromtoob': {
      'ru': '',
      'kk': '',
    },
    '3b578m74': {
      'ru': 'Поиск',
      'kk': '',
    },
    'vsndli7s': {
      'ru': 'FlutterFlow',
      'kk': '',
    },
    'b11vzb79': {
      'ru': ' - build different.',
      'kk': '',
    },
    'chjup6k3': {
      'ru': 'Hello World ',
      'kk': '',
    },
    '3sfmuvgq': {
      'ru': 'Главная',
      'kk': 'үй',
    },
  },
  // WebNav
  {
    'vlm7bibu': {
      'ru': 'Главная',
      'kk': 'үй',
    },
    'm9wqxozh': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    '2zewmmi5': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    '5q7eq54w': {
      'ru': 'Курсы',
      'kk': 'Курстар',
    },
    '367wedex': {
      'ru': 'Репетиторы',
      'kk': 'Тәрбиешілер',
    },
    'llqwgozn': {
      'ru': 'Онлайн-обучение',
      'kk': 'Онлайн тренинг',
    },
    'sj6jjbrj': {
      'ru': 'Обучение за рубежом',
      'kk': 'Шет елде оқу',
    },
    '3j5reao3': {
      'ru': 'Работа за рубежом',
      'kk': 'Шетелде жұмыс істеу',
    },
    'as9q4ir9': {
      'ru': 'Акции',
      'kk': 'Қор',
    },
    'svvnrpe2': {
      'ru': 'Служба поддержки',
      'kk': 'Қолдау қызметі',
    },
  },
  // header
  {
    'mvskhu8o': {
      'ru': '',
      'kk': 'Іздеу',
    },
    '4cjjqcto': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    '3l3uu3e1': {
      'ru': 'KZ',
      'kk': 'KZ',
    },
    'uagde776': {
      'ru': 'RU',
      'kk': 'RU',
    },
    '1fipwppl': {
      'ru': 'Войти',
      'kk': 'Кіру үшін',
    },
    'hbq46cwh': {
      'ru': 'Регистрация',
      'kk': 'Тіркеу',
    },
    '8ldp1788': {
      'ru': 'Личный кабинет',
      'kk': 'Жеке бөлме',
    },
    'lgg7qzq6': {
      'ru': 'Выход',
      'kk': 'Шығу',
    },
  },
  // footer
  {
    'pe6h010m': {
      'ru': 'Интернет олимпиады',
      'kk': 'Интернет олимпиадалары',
    },
    'd3z9uamf': {
      'ru': 'О компании',
      'kk': 'Компания жайлы',
    },
    's9fizywf': {
      'ru': 'О нас',
      'kk': 'Біз туралы',
    },
    'z915ryim': {
      'ru': 'Контакты',
      'kk': 'Контактілер',
    },
    'izchd6r1': {
      'ru': 'Служба поддержки',
      'kk': 'Қолдау қызметі',
    },
    'dl7uxp8q': {
      'ru': 'Стать партнером',
      'kk': 'Серіктес болыңыз',
    },
    '0dwxncme': {
      'ru': 'Рекламодателям',
      'kk': 'Жарнама берушілер үшін',
    },
    't445rx9d': {
      'ru': 'Пользовательское соглашение и политика конфиденциальности',
      'kk': 'Пайдаланушы келісімі және құпиялылық саясаты',
    },
    'z9e0omgs': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    '7p178lki': {
      'ru': 'Все олимпиады',
      'kk': 'Барлық олимпиадалар',
    },
    'qld6hor7': {
      'ru': 'Рейтинги',
      'kk': 'Рейтингтер',
    },
    '2t6irsei': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    '5e4zx37j': {
      'ru': 'Победители',
      'kk': 'Жеңімпаздар',
    },
    'ipwqgb9q': {
      'ru': 'Служба поддержки',
      'kk': 'Қолдау қызметі',
    },
    '06gxt7jf': {
      'ru': '8 (707) 388 08 48',
      'kk': '8 (707) 388 08 48',
    },
    'wqzr7iio': {
      'ru': 'info@mail.ru',
      'kk': 'info@mail.ru',
    },
    '5py72n83': {
      'ru': 'График работы: ',
      'kk': 'Жұмыс кестесі:',
    },
    'b0gp3s77': {
      'ru': 'Пн-Сб: ',
      'kk': 'Дүйсенбі-сенбі:',
    },
    '25fyuqv8': {
      'ru': '10:00-19:00',
      'kk': '10:00-19:00',
    },
  },
  // navbar
  {
    'nkohigd4': {
      'ru': 'Главная',
      'kk': 'үй',
    },
    'jnkw9kgn': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    'f7mr5yn2': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    'odn89qwp': {
      'ru': 'Курсы',
      'kk': 'Курстар',
    },
    'a6tmprsz': {
      'ru': 'Репетиторы',
      'kk': 'Тәрбиешілер',
    },
    'upiu295m': {
      'ru': 'Онлайн-Обучение',
      'kk': 'Онлайн тренинг',
    },
    'x9kc1qtq': {
      'ru': 'Обучение за рубежом',
      'kk': 'Шет елде оқу',
    },
    'd5ga3sfa': {
      'ru': 'Работа за рубежом',
      'kk': 'Шетелде жұмыс істеу',
    },
    'mpwz1a7k': {
      'ru': 'Акции',
      'kk': 'Қор',
    },
    'rh9dtfo7': {
      'ru': 'Служба поддержки',
      'kk': 'Қолдау қызметі',
    },
    '2uuf33vq': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
  },
  // sidenav
  {
    'dvwvd1jj': {
      'ru': 'Главная',
      'kk': 'үй',
    },
    'bqsnsqz6': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    'h8mb6g3i': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    '5rmrvztg': {
      'ru': 'Курсы',
      'kk': 'Курстар',
    },
    'nc09qm8k': {
      'ru': 'Репетиторы',
      'kk': 'Тәрбиешілер',
    },
    'svagazez': {
      'ru': 'Онлайн-Обучение',
      'kk': 'Онлайн тренинг',
    },
    '57d5fo7i': {
      'ru': 'Обучение за рубежом',
      'kk': 'Шет елде оқу',
    },
    'by3nxmd0': {
      'ru': 'Работа за рубежом',
      'kk': 'Шетелде жұмыс істеу',
    },
    'ropxydol': {
      'ru': 'Акции',
      'kk': 'Қор',
    },
    'gcfi2yiz': {
      'ru': 'Служба поддержки',
      'kk': 'Қолдау қызметі',
    },
  },
  // consultForm
  {
    'jhkoudga': {
      'ru': 'Имя',
      'kk': 'Аты',
    },
    'fncv7m6h': {
      'ru': 'Имя',
      'kk': 'Аты',
    },
    'gpmf73y9': {
      'ru': 'Email',
      'kk': 'Электрондық пошта',
    },
    'oo1g2n46': {
      'ru': 'Email',
      'kk': 'Электрондық пошта',
    },
    '0xmycy5q': {
      'ru': 'Телефон',
      'kk': 'Телефон',
    },
    'fjl4yzyp': {
      'ru': 'Номер телефона',
      'kk': 'Телефон нөмірі',
    },
    'yg7vni7u': {
      'ru': 'Сообщение',
      'kk': 'Хабар',
    },
    'sk62j7w5': {
      'ru': 'Сообщение',
      'kk': 'Хабар',
    },
    '35bii959': {
      'ru': 'Отправить',
      'kk': 'Жіберу',
    },
  },
  // WebNavOld
  {
    'bf98dpm1': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    'zdosbqjr': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    '2p7nspxu': {
      'ru': 'Курсы',
      'kk': 'Курстар',
    },
    'vqme7iu4': {
      'ru': 'Репетиторы',
      'kk': 'Тәрбиешілер',
    },
    'a1qawvcd': {
      'ru': 'Онлайн обучение',
      'kk': 'Онлайн тренинг',
    },
    'pjevir22': {
      'ru': 'Обучение за рубежом',
      'kk': 'Шет елде оқу',
    },
    'ciqcvg5j': {
      'ru': 'Работа за рубежом',
      'kk': 'Шетелде жұмыс істеу',
    },
    'gxmutb0w': {
      'ru': 'Акции',
      'kk': 'Қор',
    },
    '5ss4rw6x': {
      'ru': 'Служба поддержки',
      'kk': 'Қолдау қызметі',
    },
  },
  // WebNavLeftBottom
  {
    '7vv60e4f': {
      'ru': 'Играть',
      'kk': 'Ойнау',
    },
    '0eks2fu1': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
  },
  // headerSearch
  {
    'mzj68hos': {
      'ru': '',
      'kk': '',
    },
    'w35g62ny': {
      'ru': 'Поиск',
      'kk': 'Іздеу',
    },
    '85mhml0b': {
      'ru': 'KK',
      'kk': 'Қ.Қ',
    },
    '112t8rgv': {
      'ru': 'RU',
      'kk': 'RU',
    },
    'mz9xtk6c': {
      'ru': 'Войти',
      'kk': 'Кіру үшін',
    },
    'lqsc1wbf': {
      'ru': 'Регистрация',
      'kk': 'Тіркеу',
    },
    '4bzvcsgo': {
      'ru': 'Личный кабинет',
      'kk': 'Жеке бөлме',
    },
    'v6mmmgy1': {
      'ru': 'Выход',
      'kk': 'Шығу',
    },
  },
  // WebNavLeftTop
  {
    'bt3cm3rj': {
      'ru': 'Главная',
      'kk': 'үй',
    },
    'yzyfc0ts': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    'f22hadz5': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    'jo4da8ft': {
      'ru': 'Курсы',
      'kk': 'Курстар',
    },
    'uv49dnpk': {
      'ru': 'Репетиторы',
      'kk': 'Тәрбиешілер',
    },
    'qyynwg14': {
      'ru': 'Онлайн-обучение',
      'kk': 'Онлайн тренинг',
    },
    'xs5yimgl': {
      'ru': 'Обучение за рубежом',
      'kk': 'Шет елде оқу',
    },
    'w5mfu5qs': {
      'ru': 'Работа за рубежом',
      'kk': 'Шетелде жұмыс істеу',
    },
    'i6nn868s': {
      'ru': 'Акции',
      'kk': 'Қор',
    },
    'ds5lkvy9': {
      'ru': 'Служба поддержки',
      'kk': 'Қолдау қызметі',
    },
  },
  // WebNavLeft
  {
    'yq8c4gn1': {
      'ru': 'Главная',
      'kk': 'Басты бет',
    },
    'd6jwz0ky': {
      'ru': 'Новости',
      'kk': 'Жаңалықтар',
    },
    'h9z3dw2n': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
    'zkd6m5u1': {
      'ru': 'Курсы',
      'kk': 'Курстар',
    },
    'gj47291u': {
      'ru': 'Репетиторы',
      'kk': 'Тәрбиешілер',
    },
    'x4y16hv4': {
      'ru': 'Онлайн-обучение',
      'kk': 'Онлайн тренинг',
    },
    'hl9gndn4': {
      'ru': 'Обучение за рубежом',
      'kk': 'Шет елде оқу',
    },
    'iy3pj0uw': {
      'ru': 'Работа за рубежом',
      'kk': 'Шетелде жұмыс істеу',
    },
    'b879jh8r': {
      'ru': 'Акции',
      'kk': 'Қор',
    },
    'i0krruly': {
      'ru': 'Служба поддержки',
      'kk': 'Қолдау қызметі',
    },
    'r85k2jwh': {
      'ru': 'Олимпиады',
      'kk': 'Олимпиада',
    },
  },
  // consultFormMobile
  {
    '9isw2vao': {
      'ru': 'Имя',
      'kk': '',
    },
    'fb9aosso': {
      'ru': 'Имя',
      'kk': '',
    },
    '4ltc7b5l': {
      'ru': 'Email',
      'kk': '',
    },
    '20kti5fp': {
      'ru': 'Email',
      'kk': '',
    },
    '9kr7e703': {
      'ru': 'Телефон',
      'kk': '',
    },
    'ob6uqb0l': {
      'ru': 'Номер телефона',
      'kk': '',
    },
    'cnf4jbea': {
      'ru': 'Сообщение',
      'kk': '',
    },
    'zmvifwz4': {
      'ru': 'Сообщение',
      'kk': '',
    },
    'sy3nbm3e': {
      'ru': 'Отправить',
      'kk': '',
    },
  },
  // headerCopy
  {
    'm3c7zpro': {
      'ru': '',
      'kk': '',
    },
    '792haf6k': {
      'ru': 'Поиск',
      'kk': '',
    },
    'zptxjj25': {
      'ru': 'KZ',
      'kk': '',
    },
    'sz0zr2cs': {
      'ru': 'RU',
      'kk': '',
    },
    'plzz6g82': {
      'ru': 'Войти',
      'kk': '',
    },
    'vx0f2fo6': {
      'ru': 'Регистрация',
      'kk': '',
    },
    'so6z8d5j': {
      'ru': 'Личный кабинет',
      'kk': '',
    },
    '15p7zb7k': {
      'ru': 'Выход',
      'kk': '',
    },
  },
  // Miscellaneous
  {
    '18p0mg5x': {
      'ru': '',
      'kk': '',
    },
    'p8b63234': {
      'ru': '',
      'kk': '',
    },
    'u4hwxiri': {
      'ru': '',
      'kk': '',
    },
    'qsa4hud1': {
      'ru': '',
      'kk': '',
    },
    'nq8vpft5': {
      'ru': '',
      'kk': '',
    },
    '0xxvr5yz': {
      'ru': '',
      'kk': '',
    },
    'i8tjyarf': {
      'ru': '',
      'kk': '',
    },
    'fm6rjtor': {
      'ru': '',
      'kk': '',
    },
    '5g1rbpfv': {
      'ru': '',
      'kk': '',
    },
    'fkijbits': {
      'ru': '',
      'kk': '',
    },
    'xz5hy3vt': {
      'ru': '',
      'kk': '',
    },
    '2avbvte1': {
      'ru': '',
      'kk': '',
    },
    'vu9ly1or': {
      'ru': '',
      'kk': '',
    },
    '11aq49qj': {
      'ru': '',
      'kk': '',
    },
    'jbsz6u8k': {
      'ru': '',
      'kk': '',
    },
    'rhab44er': {
      'ru': '',
      'kk': '',
    },
    'wbt4pys9': {
      'ru': '',
      'kk': '',
    },
    'x9d3deja': {
      'ru': '',
      'kk': '',
    },
    're6sxhyp': {
      'ru': '',
      'kk': '',
    },
    'u64ebs99': {
      'ru': '',
      'kk': '',
    },
    'f0db0uue': {
      'ru': '',
      'kk': '',
    },
    'g3uzge5w': {
      'ru': '',
      'kk': '',
    },
    '6d6201up': {
      'ru': '',
      'kk': '',
    },
    'lwu9b5ph': {
      'ru': '',
      'kk': '',
    },
    '7q6kt49h': {
      'ru': '',
      'kk': '',
    },
  },
].reduce((a, b) => a..addAll(b));
